{"ANG1903": {"name": "ANG 1903 - Anglais 3 (niveau B1.1)", "description": "Communiquer dans des domaines d'intérêt personnel. Compréhension de discussions sur des sujets divers. Rédactions. Lecture d'un livre court et/ou de courts textes. Approfondissement de la connaissance des pays anglophones.  Remarques: 1re partie du niveau B1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ANG1902", "ANG1903", "ANG1967", "ANG1850"]}, "ANG1913": {"name": "ANG 1913 - Lire en anglais 2 (niveau B2 sciences)", "description": "Saisir le sens de textes sur des sujets en sciences. Analyse de phénomènes lexicaux et de particularités grammaticales et stylistiques réservées au style scientifique. Lecture personnelle. Enrichissement du vocabulaire.  Remarques: Approche analytique.", "prereqs": ["ANG1911", "ANG1904", "ANG1974", "ANG1913"]}, "ANG1921": {"name": "ANG 1921 - Écrire en anglais 1 (niveau B1)", "description": "Rédiger des textes courants. Enrichissement du vocabulaire et de la grammaire propre au style écrit. Apprentissage de stratégies de planification d'écriture.  Remarques: Approche analytique.", "prereqs": ["ANG1902"]}, "BCM1501": {"name": "BCM 1501 - Origine biochimique de la vie", "description": "Caractéristiques de la vie. Conditions physico-chimiques. Structure et propriétés des glucides, lipides, acides aminés, protéines, nucléotides, vitamines. Des molécules organiques aux premières cellules. Évolution.", "prereqs": 0}, "BCM1503": {"name": "BCM 1503 - Acides nucléiques et génétique 1", "description": "Métabolisme des nucléotides. Structure de l'ADN, de l'ARN, de la chromatine et des chromosomes. Réplication, dégradation, mutation, réparation et recombinaison de l'ADN. Code génétique. Mécanismes de l'hérédité. Maladies génétiques.", "prereqs": ["BCM1501"]}, "BIN6002": {"name": "BIN 6002 - Principes d'analyse génomique", "description": "Identification (gènes protéiques et d'ARNs structuraux introns) par comparaison de séquences et recherche de motifs. Alignements multiples et code génétique. Assemblage et annotation de séquence génomique.", "prereqs": []}, "BIN6003": {"name": "BIN 6003 - Architecture des polymères biologiques", "description": "Conformation macromoléculaire. Analyse de structures tridimensionnelles.", "prereqs": 0}, "BIO1203": {"name": "BIO 1203 - Introduction à la génétique", "description": "Loi de Mendel et mécanismes de l'hérédité. Linkage génétique et recombinaison. Probabilités et génétique. Éléments de cytogénétique. Mutations. Applications en biotechnologie et impact social.", "prereqs": 0}, "COM2001": {"name": "COM 2001 - Communication et mondialisation", "description": "Théories et enjeux relatifs à la communication dans les processus et contextes de la mondialisation tels que le néoimpérialisme, l'hégémonie, la revendication et la contestation. Informations, cultures et médias transnationaux et locaux.", "prereqs": 0}, "DRT1002": {"name": "DRT 1002S - Introduction au droit", "description": "Notions de droit, de règle de droit. Sources de la règle de droit. Pouvoirs législatif, exécutif et judiciaire : composition et compétence. Éléments fondamentaux de droit civil et de common law.", "prereqs": 0}, "ECN1000": {"name": "ECN 1000 - Principes d'économie", "description": "Présentation des outils de base de l'analyse économique : coût d'opportunité, offre, demande et prix; choix des consommateurs; choix de production des firmes; marchés concurrentiels; monopole; efficacité; commerce international.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN1050": {"name": "ECN 1050 - Introduction à la macroéconomie", "description": "Interdépendance des marchés et comptabilité nationale et financière. Marchés monétaires et théories de l'inflation. Marché du travail et types de chômage. Modèles de long et de court termes. Modèle IS-LM; fluctuations économiques.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN2230": {"name": "ECN 2230 - Institutions et marchés financiers", "description": "Monnaie et régimes monétaires. Les marchés financiers et la réglementation. Instruments financiers. Opérations bancaires. Gestion monétaire. Marchés des changes. Marchés boursiers.", "prereqs": ["ECN1000"]}, "GEO1532": {"name": "GEO 1532 - SIG1 - Cartographie", "description": "Les données cartographiques, les données spatiales numériques, les méthodes d'acquisition de données cartographiques, les projections cartographiques, échelle et contenu d'une carte, la sémiologie graphique, les cartes topographiques et thématiques.    Remarques: Laboratoires avec logiciels de cartographie par ordinateur.", "prereqs": 0}, "GEO1542": {"name": "GEO 1542 - Introduction à la télédétection", "description": "Initiation à la télédétection et aux applications d'images optiques et radar en géographie. Méthodes de suivi environnemental par télédétection.  Remarques: Laboratoires de photo-interprétation et d'analyse d'images assistées par ordinateur.", "prereqs": 0}, "IFT1005": {"name": "IFT 1005 - Design et développement Web", "description": "Introduction à l'internet et au Web. Langage de balisage et validation. Standards, accessibilité. Feuilles de styles pour texte et graphique. Design web. Optimisation des sites. Formulaires et interactivité. Introduction aux gestionnaires de contenu.", "prereqs": 0}, "IFT1015": {"name": "IFT 1015 - Programmation 1", "description": "Éléments de base d'un langage de programmation : types, expressions, énoncés conditionnels et itératifs, procédures, fonctions, paramètres, récursivité, tableaux, enregistrements, pointeurs et fichiers.", "prereqs": 0}, "IFT1025": {"name": "IFT 1025 - Programmation 2", "description": "Concepts avancés : classes, objets, héritage, interfaces, réutilisation, événements. Introduction aux structures de données et algorithmes : listes, arbres binaires, fichiers, recherche et tri. Notions d'analyse numérique : précision.", "prereqs": ["IFT1015", "IFT1016"]}, "IFT1065": {"name": "IFT 1065 - Structures discrètes en informatique", "description": "Éléments de logique propositionnelle. Ensembles. Suites et fonctions. Algorithmes. Matrices booléennes. Raisonnement mathématique. Induction. Combinatoire. Relations de récurrence. Graphes, Arbres.", "prereqs": []}, "IFT1215": {"name": "IFT 1215 - Introduction aux systèmes informatiques", "description": "Historique. Composantes d'un ordinateur. Codage des données et des instructions. Langages machine et de haut niveau. Concepts et utilisation d'un système d'exploitation. Introduction à l'Internet. Conséquences sociales de l'informatique.", "prereqs": 0}, "IFT1227": {"name": "IFT 1227 - Architecture des ordinateurs 1", "description": "Jeu d'instructions : RISC vs CISC. Modes d'adressage. Exceptions. Dispositifs d'entrée/sortie, bus, interruptions. Contrôle câblé et microprogrammé. Accélération du traitement : pipelines et parallélisme. Évolution des technologies.", "prereqs": ["IFT1065", "IFT1215"]}, "IFT1575": {"name": "IFT 1575 - Modèles de recherche opérationnelle", "description": "Programmation linéaire. Simplexe. Dualité. Programmation en nombres entiers. Problèmes de réseaux. Méthodes PERT/CPM. Plus court chemin. Programmation dynamique déterministe et probabiliste. Modèles stochastiques.", "prereqs": 0}, "IFT2015": {"name": "IFT 2015 - Structures de données", "description": "Types abstraits pour les structures de données, arbres, dictionnaires, files avec priorités, graphes, méthodes externes.", "prereqs": ["IFT1025", "IFT1065"]}, "IFT2035": {"name": "IFT 2035 - Concepts des langages de programmation", "description": "Historique. Concepts et implantation des entités de base. Mécanismes d'exécution : pile, tas, passage de paramètres. Langage de bas niveau (C). Programmation structurée, fonctionnelle et logique. Langages spécialisés.", "prereqs": ["IFT1025"]}, "IFT2105": {"name": "IFT 2105 - Introduction à l'informatique théorique", "description": "Automates finis et expressions régulières. Grammaires hors-contexte et automates à piles. Calculabilité et décidabilité. Classes de complexité.", "prereqs": ["IFT1015", "IFT1065"]}, "IFT2125": {"name": "IFT 2125 - Introduction à l'algorithmique", "description": "Conception et analyse d'algorithmes. Notation asymptotique, résolution de récurrences. Algorithmes voraces, diviser-pour-régner, programmation dynamique, parcours de graphes, retour-arrière, algorithmes probabilistes.", "prereqs": ["IFT2125", "IFT2015", "MAT1978", "MAT1720"]}, "IFT2245": {"name": "IFT 2245 - Systèmes d'exploitation", "description": "Fonctions principales. Gestion du parallélisme. Synchronisation. Interblocage. Ordonnancement. Gestion de la mémoire et des entrées/sorties. Fichiers. Protection et systèmes distribués.", "prereqs": ["IFT1227", "IFT2035"]}, "IFT2255": {"name": "IFT 2255 - Génie logiciel", "description": "Introduction au génie logiciel. Cycles de développement. Analyse, modélisation et spécification. Conception. Développement orienté objet. Mise au point. Outils et environnements de développement.", "prereqs": ["IFT1025"]}, "IFT2425": {"name": "IFT 2425 - Introduction aux algorithmes numériques", "description": "Arithmétique en point flottant, analyse d'erreurs. Équations linéaires et non linéaires. Interpolation, moindres carrés. Différenciation et intégration numérique. Équations différentielles ordinaires.", "prereqs": ["IFT1015", "MAT1400", "MAT1600"]}, "IFT2455": {"name": "IFT 2455 - Analyse numérique matricielle", "description": "Solution numérique des systèmes d'équations linéaires; inversion; triangularisation. Méthodes directes, méthodes d'itération, etc. Approximation des valeurs propres. Applications diverses.", "prereqs": ["IFT1015", "MAT1600"]}, "IFT2505": {"name": "IFT 2505 - Optimisation linéaire", "description": "Modèles linéaires. Méthode du simplexe. Dualité. Postoptimisation. Analyse de sensibilité. Problèmes à structures particulières. Modèles en nombres entiers. Méthodes de coupes. Séparation et évaluation progressive.", "prereqs": ["MAT1600"]}, "IFT2550": {"name": "IFT 2550 - Stage d'informatique 1", "description": "Premier stage du programme COOP, en milieu de travail, donnant lieu à un rapport, évalué conjointement par l'employeur et un jury du DIRO.", "prereqs": []}, "IFT2905": {"name": "IFT 2905 - Interfaces personne-machine", "description": "Concept et langages des interfaces. Programmation par événements. Modèle de l'usager. Design et programmation d'interfaces graphiques. Impact sur les multimédia, la collaboration et la communication.", "prereqs": ["IFT1025", "IFT2905", "IFT3904"]}, "IFT2935": {"name": "IFT 2935 - Bases de données", "description": "Architecture. Modèles d'organisation. Définition, création, mise à jour et consultation. Exploitation.", "prereqs": ["IFT2015", "IFT2935", "IFT3030"]}, "IFT3065": {"name": "IFT 3065 - Langages de programmation et compilation", "description": "Méthodes de compilation et interprétation des langages de programmation. Génération de code, optimisation, transformations de programme. Gestion de la mémoire. Implantation des langages spécialisés.", "prereqs": ["IFT2035", "IFT3065", "IFT3060"]}, "IFT3150": {"name": "IFT 3150 - Projet d'informatique", "description": "Projet défini et encadré par un professeur associé à un laboratoire de recherche universitaire.  Remarques: Préalables explicites selon la nature du projet.", "prereqs": ["IFT3150", "IFT3051"]}, "IFT3151": {"name": "IFT 3151 - Stage d'informatique", "description": "Stage en milieu de travail, donnant lieu à un rapport, évalué conjointement par l'employeur et un jury du DIRO.", "prereqs": ["IFT3151", "IFT3052"]}, "IFT3155": {"name": "IFT 3155 - Informatique quantique", "description": "Calcul réversible; information quantique; non-localité; cryptographie quantique; circuits, parallélisme et interférence quantiques; algorithmes de Simon, Shor et Grover; téléportation; correction d'erreurs; implantation.", "prereqs": []}, "IFT3205": {"name": "IFT 3205 - Traitement du signal", "description": "Systèmes linéaires. Échantillonnage et reconstruction. Convolution. Notation polaire. Transformées-Z et de Fourier. Analyse spectrale. Filtrage numérique (FIR et IIR). Applications dans les domaines de l'audio, de l'image et de la vidéo.", "prereqs": ["MAT1400", "MAT1600", "IFT3205", "IFT3200"]}, "IFT3225": {"name": "IFT 3225 - Technologie de l'Internet", "description": "Introduction aux applications web et organisation des sites web. XML, schémas XML et transformations XSLT. Programmation client (JavaScript) et serveur (CGI, PHP, Ajax). Moteurs de recherche. Design web. Introduction au web sémantique.", "prereqs": ["IFT1005", "IFT2015", "IFT3225", "IFT3220"]}, "IFT3245": {"name": "IFT 3245 - Simulation et modèles", "description": "Modèles de simulation. Simulations continues et à événements discrets. Modélisation stochastique. Validation et réalisme. Analyse des résultats. Technique de réduction de la variance. Génération de valeurs pseudoaléatoires.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "PHY2215", "IFT3245", "IFT3240"]}, "IFT3275": {"name": "IFT 3275 - Sécurité informatique", "description": "Confidentialité et intégrité des données à clé privée et publique. Protection des couches de protocoles TCP/IP; protection contre les parasites informatiques. Méthodes d'authentification d'usagers. Évaluation et gestion des risques.", "prereqs": 0}, "IFT3295": {"name": "IFT 3295 - Bio-informatique", "description": "Biologie moléculaire pour l'informaticien, biomolécules, transcription, traduction. Algorithmes de programmation dynamique, alignements de séquences, prédiction de structures d'ARN. Réseaux de régulation génétique. Phylogénie, génomique comparative.", "prereqs": ["IFT2015", "IFT3295", "IFT3290"]}, "IFT3325": {"name": "IFT 3325 - Téléinformatique", "description": "Architecture des systèmes répartis. Modèle de référence OSI. Introduction aux moyens physiques de transmission de données. Protocoles de lien, de routage et de contrôle de flux. Introduction aux réseaux d'ordinateurs et à leurs protocoles.", "prereqs": ["IFT2245", "IFT3325", "IFT3320"]}, "IFT3335": {"name": "IFT 3335 - Intelligence artificielle : introduction", "description": "Résolution heuristique de problèmes. Représentation des connaissances. Techniques d'inférence et de planification. Étude d'un langage approprié. Traitement de langue naturelle. Apprentissage. Systèmes experts.", "prereqs": ["IFT3335", "IFT3330"]}, "IFT3355": {"name": "IFT 3355 - Infographie", "description": "2D : tracé, remplissage. 3D : transformations, projections. Surfaces cachées. Illumination : modèles de réflexion. Textures : antialiassage. Modélisation : surfaces paramétriques. Animation : interpolation, cinématique, dynamique.", "prereqs": ["IFT2015", "IFT3355", "IFT3350"]}, "IFT3375": {"name": "IFT 3375 - Informatique théorique", "description": "Modèles du calcul. Calculabilité et décidabilité. Complexité. Hiérarchies. Complétudes. Sujets choisis.", "prereqs": ["IFT2105", "IFT3375", "IFT3370"]}, "IFT3395": {"name": "IFT 3395 - Fondements de l'apprentissage machine", "description": "Éléments de base des algorithmes d'apprentissage statistique et symbolique. Exemples d'applications en forage de données, reconnaissance des formes, régression non linéaire, et données temporelles.  Remarques: Des connaissances d'analyse numérique sont recommandées, par exemple le IFT 2425.", "prereqs": ["MAT1600", "MAT1978", "IFT2125", "IFT3395", "IFT3390"]}, "IFT3515": {"name": "IFT 3515 - Optimisation non linéaire", "description": "Programmation non linéaire. Conditions d'optimalité avec et sans contraintes. Méthodes de directions de descente, de Newton et quasi-Newton. Méthodes de recherche linéaire et de régions de confiance. Méthode de points intérieurs.", "prereqs": ["MAT1600"]}, "IFT3545": {"name": "IFT 3545 - Graphes et réseaux", "description": "Introduction à la théorie des graphes et à ses applications en informatique. Arborescences, connexité, coloriages, stabilité. Algorithmes sur les graphes. Applications.", "prereqs": ["IFT3545", "IFT3540"]}, "IFT3550": {"name": "IFT 3550 - Stage d'informatique 2", "description": "Deuxième stage du programme COOP, en milieu de travail, donnant lieu à  un rapport, évalué conjointement par l'employeur et un jury du DIRO.", "prereqs": ["IFT2550"]}, "IFT3551": {"name": "IFT 3551 - Stage d'informatique 3", "description": "Troisième stage du programme COOP, en milieu de travail, donnant lieu à  un rapport, évalué conjointement par l'employeur et un jury du DIRO.", "prereqs": ["IFT3550"]}, "IFT3655": {"name": "IFT 3655 - Modèles stochastiques", "description": "Processus stochastiques. Chaînes de Markov. Horizons finis et infinis. Actualisation. Files d'attente. Processus de décision markoviens. Résolution d'équations de récurrence. Modèles d'inventaire. Fiabilité.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "IFT3655", "IFT3651"]}, "IFT3700": {"name": "IFT 3700 - Introduction à la science des données", "description": "Mise en contexte et applications des probabilités, statistiques, optimisation et outils informatiques pour la science des données; nettoyage et visualisation de données; enjeux statistiques de l'apprentissage automatique sur données structurées.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "STT1700"]}, "IFT3710": {"name": "IFT 3710 - Projets en aprentissage automatique", "description": "Préparation aux applications pratiques de l'apprentissage automatique à travers des projets concrets sur les données réelles. Utilisation de logiciels spécialisés d'apprentissage automatique pour l'intelligence artificielle.", "prereqs": ["IFT3700", "IFT3395"]}, "IFT3911": {"name": "IFT 3911 - Analyse et conception des logiciels", "description": "Ingénierie des besoins. Méthodes de spécification formelle. Principes, méthodes et notations de conception. Description et styles d'architectures logicielles. Composantes logicielles, patrons de conception et cadres d'application.", "prereqs": ["IFT2255", "IFT3911", "IFT3901"]}, "IFT3913": {"name": "IFT 3913 - Qualité du logiciel et métriques", "description": "Définition et promotion de la qualité. Assurance qualité. Plan de qualité. Amélioration et contrôle de qualité (tests, revue, inspections). Normes et cadres de qualité. Théorie de la mesure. Métriques de produit et de processus. Métriques de qualité.", "prereqs": ["IFT2255", "IFT3913", "IFT3903"]}, "IFT4055": {"name": "IFT 4055 - Projet informatique honor", "description": "Initiation à la recherche par le biais d'un projet défini et encadré par  un professeur au sein d'un laboratoire du DIRO, évalué conjointement par  le professeur et un jury du DIRO.", "prereqs": []}, "IFT6010": {"name": "IFT 6010 - Intelligence artificielle", "description": "Représentation des connaissances. Logique classique et techniques de résolution automatique de problèmes. Raisonnement non monotone, induction, connaissances et croyances. Planification.", "prereqs": ["IFT3330", "IFT6330"]}, "IFT6042": {"name": "IFT 6042 - Synthèse d'images", "description": "Modélisation géométrique. Courbes et surfaces. Visibilité. Lumière et ombrage. Modèles de transparence, réflexion, réfraction. Textures. Fractales et modèles stochastiques. Antialiasing. Lancer de rayons. Phénomènes naturels.", "prereqs": 0}, "IFT6141": {"name": "IFT 6141 - Reconnaissance des formes", "description": "Classification. Regroupement. Modèles paramétriques et non paramétriques. Systèmes adaptatifs. Analyse de scènes. Aperçu des applications (télédétection, médecine, automation...).", "prereqs": []}, "IFT6145": {"name": "IFT 6145 - Vision tridimensionnelle", "description": "Concepts de vision par ordinateur. Calibrage de caméra, stéréoscopie, flux optique, mosaïques et panoramas. Méthodes de reconstruction volumétrique.", "prereqs": 0}, "IFT6150": {"name": "IFT 6150 - Traitements d'images", "description": "Échantillonnage. Opérations sur les images. Amélioration. Restauration. Compression. Réalisation d'un projet appliqué.", "prereqs": 0}, "IFT6155": {"name": "IFT 6155 - Informatique quantique", "description": "Calcul réversible; information quantique; non-localité; cryptographie quantique; circuits, parallélisme et interférence quantiques; algorithmes de Simon, Shor et Grover; téléportation; correction d'erreurs; implantation.", "prereqs": 0}, "IFT6172": {"name": "IFT 6172 - Sémantique des langages de programmation", "description": "Historique. Définitions de style opératoire (Vienne), dénotationnel (Scott) et déductif (Hoare, Dijkstra). Notions d'algèbre universelle, théorie des domaines, lambda-calcul typé. Illustrations pratiques. Développements récents.", "prereqs": 0}, "IFT6180": {"name": "IFT 6180 - Cryptologie : théorie et applications", "description": "Historique et définitions. Cryptographie et cryptanalyse. Théorie de l'information. Cryptographie conventionnelle, à clefs publiques, probabiliste et quantique. Génération pseudo et quasi aléatoire. Applications diverses.", "prereqs": 0}, "IFT6232": {"name": "IFT 6232 - Compilation", "description": "Aspects de l'organisation d'un compilateur; génération et optimisation de code, récupération d'erreurs, analyse de flot de contrôle. Interprètes, performance, test et diffusion. Écriture d'un compilateur générant du code pour une machine réelle.", "prereqs": []}, "IFT6255": {"name": "IFT 6255 - Recherche d'information", "description": "Principe de la recherche d'information. Sélection des documents pertinents. Modèles booléen, vectoriel, probabiliste, logique. Réalisation. Évaluation des performances. Analyses linguistiques, syntaxiques et sémantiques.", "prereqs": 0}, "IFT6261": {"name": "IFT 6261 - Traitement des connaissances", "description": "Intelligence artificielle, sécurité de l'information, économie des données personnelles, éthique de l'intelligence artificielle, médias sociaux, apprentissage à distance, commerce électronique, agents intelligents, systèmes de recommandation.", "prereqs": ["IFT3335"]}, "IFT6271": {"name": "IFT 6271 - Sécurité informatique", "description": "Confidentialité et intégrité des données. Protection des réseaux et du commerce électronique. Clefs publiques et les tiers de confiance. Méthodes d'authentification. Coupe-feu. Gestion des mots de passe. Évaluation et gestion des risques et sécurité.", "prereqs": 0}, "IFT6291": {"name": "IFT 6291 - Bio-informatique génomique", "description": "Comparaison et alignement des séquences biologiques. Structures secondaires des acides ribonucléiques. Recherche de motifs. Assemblage de fragments d'ADN, cartographie physique. Ordre des gènes.", "prereqs": 0}, "IFT6292": {"name": "IFT 6292 - Bio-informatique moléculaire", "description": "Structure 3D des protéines et ARN. Modèles et optimisation de l'énergie potentielle, moléculaire. Espace et recherche de conformations, modélisation comparative et de novo.", "prereqs": 0}, "IFT6521": {"name": "IFT 6521 - Programmation dynamique", "description": "Processus de décision séquentiels déterministes et stochastiques. Horizons finis et infinis. Équations de récurrence. Algorithmes : itération des valeurs, itération des politiques, programmation linéaire, méthodes hybrides.", "prereqs": ["IFT2505", "MAT1720", "MAT1978"]}, "IFT6551": {"name": "IFT 6551 - Programmation en nombres entiers", "description": "Méthodes de troncature, génération de facettes. Méthodes d'énumération. Méthodes de décomposition. Applications : recouvrement et partition d'ensembles, localisation de dépôts, voyageur de commerce, problèmes d'horaire.", "prereqs": ["IFT3515"]}, "IFT6561": {"name": "IFT 6561 - Simulation : aspects stochastiques", "description": "Modèles stochastiques à événements discrets. Modélisation des aléas. Analyse des résultats et intervalles de confiance. Réduction de la variance. Analyse de sensibilité et optimisation. Génération de valeurs aléatoires.", "prereqs": 0}, "LCO2030": {"name": "LCO 2030 - Littérature, technologies et médias", "description": "Analyse des interactions entre la littérature (institution, production, textualité), les médias et les technologies (hypertexte, film, vidéo).", "prereqs": []}, "LNG1080": {"name": "LNG 1080 - Notions de lexicologie, morphologie et sémantique", "description": "Notions de base de lexicologie, sémantique et morphologie. Thèmes abordés : unité lexicale, signes et règles morphologiques, structure du lexique, relations lexicales, analyse sémantique, phénomènes lexico-pragmatiques, approches lexicographiques.", "prereqs": 0}, "LNG1955": {"name": "LNG 1955 - Notions générales de linguistique", "description": "Ce cours vise à donner une formation linguistique de base.  Remarques: (La section Z est réservée aux étudiants de l'École d'orthophonie et d'audiologie.)", "prereqs": 0}, "MAT1400": {"name": "MAT 1400 - Calcul 1", "description": "Suites, séries. Fonctions de plusieurs variables, continuité, dérivées partielles, différentielles, plan tangent, dérivation en chaîne. Gradient, surfaces de niveau, extremums. Intégrales multiples, changement de variables, jacobien.", "prereqs": 0}, "MAT1600": {"name": "MAT 1600 - Algèbre linéaire", "description": "Systèmes d'équations linéaires, élimination de Gauss, inverse matricielle. Espace vectoriel, indépendance linéaire, transformations linéaires, changement de base. Produit scalaire. Déterminants. Diagonalisation. Exemples d'applications.", "prereqs": 0}, "MAT1978": {"name": "MAT 1978 - Probabilités et statistique", "description": "Probabilités, indépendance. Variables aléatoires. Espérance. Lois de probabilité. Vecteurs aléatoires. Loi des grands nombres, théorème limite central. Intervalles de confiance. Régression linéaire. Test du khi-deux.  Remarques: Cours pour informaticiens.", "prereqs": ["IFT1063", "IFT1065", "MAT1400"]}, "MAT2450": {"name": "MAT 2450 - Mathématiques et technologie", "description": "Étude de plusieurs sujets dans des domaines où les mathématiques jouent un rôle essentiel pour la technologie : informatique, cryptographie, transports, biotechnologie, pharmacie, traitement d'images, reconnaissances de formes, etc.", "prereqs": ["MAT1400", "MAT1600", "MAT2450", "MAT1720", "MAT1978"]}, "MAT2531": {"name": "MAT 2531 - Histoire des mathématiques", "description": "Les mathématiques dans l'Antiquité. Les mathématiques en Chine, en Inde et chez les Arabes. Les mathématiques en Europe de 500 à 1600. La géométrie analytique. Le calcul infinitésimal. Le développement de l'analyse. Les mathématiques du XXe siècle.", "prereqs": ["MAT2531", "MAT1400", "MAT1600"]}, "MCB1979": {"name": "MCB 1979 - Microbiologie générale", "description": "Introduction aux méthodes d'étude des bactéries, des levures et des virus. Morphologie, physiologie, génétique. Introduction à l'immunologie; antigènes, anticorps, applications.  Remarques: Travaux pratiques en relation avec les sujets théoriques.", "prereqs": ["MCB1979", "MCB1980"]}, "MUS1323": {"name": "MUS 1323 - Création musicale en langage Python 1", "description": "Cours d'introduction à l'informatique musicale avec le langage de programmation Python et le moteur audio pyo. Principe de base de la programmation orientée objet. Élaboration de processus musicaux. Design d'interfaces graphiques de contrôle.", "prereqs": ["MUS1321"]}, "PHI1130": {"name": "PHI 1130 - Philosophie des sciences", "description": "La science comme entreprise rationnelle : spécificité de l'explication scientifique. Notions d'hypothèse, de loi, de théorie. Le développement de la science : modèles continuistes et discontinuistes.", "prereqs": 0}, "PHI2005": {"name": "PHI 2005 - Logique 2", "description": "Introduction à la métalogique propositionnelle : complétude et décidabilité de la logique propositionnelle classique. Introduction à des variantes et alternatives logiques intuitionniste, multivalente, modale, floue, etc.", "prereqs": 0}, "PHY1651": {"name": "PHY 1651 - Mécanique classique 1", "description": "Concepts fondamentaux de la mécanique. Lois de conservation. Rotation autour d'un axe. Forces centrales. Problème de Kepler. Diffusion et section efficace. Gravitation.", "prereqs": 0}, "PSY2055": {"name": "PSY 2055 - Psychologie de la perception", "description": "Principales problématiques : perspective historique et théories contemporaines. Processus perceptifs de la perception de l'environnement (espace, forme, mouvement) : analyse phénoménale et étude comparative des diverses approches et interprétations.", "prereqs": ["PSY1006"]}, "PSY2065": {"name": "PSY 2065 - Processus cognitifs 1", "description": "Étude des processus attentionnels et mnésiques de l'être humain. Aperçu des principaux résultats et des principales théories concernant l'acquisition, la rétention et la récupération des connaissances et des souvenirs.", "prereqs": ["PSY1006", "PSY2065", "FAS1060"]}, "RED2000": {"name": "RED 2000 - Rédaction administrative", "description": "Les communications administratives. Particularités et difficultés lexicales et stylistiques. Documents administratifs : correspondance, ordre du jour, procès-verbal, c.v. Le rapport : cueillette, analyse, structuration des informations, rédaction.    Remarques: Travaux pratiques", "prereqs": []}, "REI1010": {"name": "REI 1010 - Introduction aux relations industrielles", "description": "Champ d'études: relations du travail, gestion des ressources humaines et politiques publiques du travail. Constitution et évolution des relations industrielles sur le plan théorique. Les acteurs: rôles, objectifs, structures et activités.", "prereqs": ["REI1010", "REI1010"]}, "STT2700": {"name": "STT 2700 - Concepts et méthodes en statistique", "description": "Estimation ponctuelle et par intervalle. Tests d'hypothèses. Méthodes graphiques. Test du khi-deux. Théorie de la décision et inférence bayésienne. Comparaisons de deux échantillons. Lié aux examens CAS et agrément ICA.", "prereqs": ["MAT1720", "MAT1978", "STT1700"]}}