{"ALL1901": {"name": "ALL 1901 - Allemand 1 (niveau A1.1)", "description": "Communiquer dans des situations très simples. Acquisition de vocabulaire, des principes de la prononciation, de la formation des mots et des structures très simples. Aperçu des réalités des pays germanophones.  Remarques: 1re partie du niveau A1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": []}, "ALL1902": {"name": "ALL 1902 - Allemand 2 (niveau A1.2)", "description": "Communiquer dans des situations simples. Acquisition de vocabulaire, des principes de la prosodie, de la formation des mots et des structures simples. Exercices d'écriture et de conversation. Aperçu des réalités des pays germanophones.  Remarques: 2e partie du niveau A1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ALL1902", "ALL1901"]}, "ALL1903": {"name": "ALL 1903 - Allemand 3 (niveau A2.1)", "description": "Communiquer dans quelques situations familières. Enrichissement du vocabulaire et acquisition de la grammaire de base. Exercices d'écriture et lecture de très courts textes. Sensibilisation aux réalités des pays germanophones.  Remarques: 1re partie du niveau A2. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ALL1903", "ALL1902"]}, "ALL1904": {"name": "ALL 1904 - Allemand 4 (niveau A2.2)", "description": "Communiquer dans plusieurs situations familières. Approfondissement de la grammaire de base. Conversation, compositions, lecture de courts textes de difficulté moyenne. Sensibilisation aux réalités des pays germanophones.  Remarques: 2e partie du niveau A2. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ALL1904", "ALL1903"]}, "ANG1103": {"name": "ANG 1103 - Composition: Critical Writing", "description": "Pratique de lecture et de rédaction courantes en études littéraires anglaises.", "prereqs": 0}, "ANG1903": {"name": "ANG 1903 - Anglais 3 (niveau B1.1)", "description": "Communiquer dans des domaines d'intérêt personnel. Compréhension de discussions sur des sujets divers. Rédactions. Lecture d'un livre court et/ou de courts textes. Approfondissement de la connaissance des pays anglophones.  Remarques: 1re partie du niveau B1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ANG1902", "ANG1903", "ANG1967", "ANG1850"]}, "ANG1904": {"name": "ANG 1904 - Anglais 4 (niveau B1.2)", "description": "Communiquer sur des sujets variés. Compréhension de différents médias. Rédactions. Lecture d'un livre court et/ou de courts textes. Discussion sur les cultures anglophones du monde.  Remarques: 2e partie du niveau B1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ANG1903", "ANG1968", "ANG1904"]}, "ANG1911": {"name": "ANG 1911 - Lire en anglais 1 (niveau B1)", "description": "Saisir le sens de textes généraux. Lecture de textes présentant des spécificités linguistiques. Enrichissement du vocabulaire et de la grammaire propre au style écrit. Apprentissage de stratégies de lecture. Lecture personnelle.  Remarques: Approche analytique.", "prereqs": ["ANG1902"]}, "ANG1913": {"name": "ANG 1913 - Lire en anglais 2 (niveau B2 sciences)", "description": "Saisir le sens de textes sur des sujets en sciences. Analyse de phénomènes lexicaux et de particularités grammaticales et stylistiques réservées au style scientifique. Lecture personnelle. Enrichissement du vocabulaire.  Remarques: Approche analytique.", "prereqs": ["ANG1911", "ANG1904", "ANG1974", "ANG1913"]}, "ANT1013": {"name": "ANT 1013 - Éléments d'ethnologie", "description": "Présentation et discussion des concepts nécessaires à la compréhension des divers niveaux d'organisation des sociétés --économique, politique, idéologique.", "prereqs": ["ANT1013", "ANT1950"]}, "DMO1000": {"name": "DMO 1000 - Introduction à la démographie", "description": "Introduction aux phénomènes majeurs modifiant les populations humaines, dans leur structure et dans leur mouvement : fécondité, nuptialité, mortalité, migration. Histoire des populations et croissance démographique. Perspectives de populations.", "prereqs": ["DMO1000", "DMO1010", "DMO6050"]}, "DMO3150": {"name": "DMO 3150 - Vieillissement des populations", "description": "Concepts de base, grandes tendances du vieillissement des populations, principales sources de données, les causes du vieillissement de la population au Canada/Québec et ailleurs, les conséquences, débats et politiques publiques.", "prereqs": []}, "DMO3450": {"name": "DMO 3450 - Économie et population", "description": "Facteurs économiques agissant sur la mortalité, la nuptialité, la fécondité et la migration. Effet des phénomènes démographiques sur la vie économique. Démographie économique de l'individu. Théories et modèles simples.", "prereqs": []}, "ECN1000": {"name": "ECN 1000 - Principes d'économie", "description": "Présentation des outils de base de l'analyse économique : coût d'opportunité, offre, demande et prix; choix des consommateurs; choix de production des firmes; marchés concurrentiels; monopole; efficacité; commerce international.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN1040": {"name": "ECN 1040 - Introduction à la microéconomie", "description": "Éléments de finance : décisions d'épargne et marchés financiers; concurrence imparfaite : progrès technologique et informations imparfaites; rôle de l'État : environnement, efficacité, équité.", "prereqs": ["ECN1000"]}, "ECN1050": {"name": "ECN 1050 - Introduction à la macroéconomie", "description": "Interdépendance des marchés et comptabilité nationale et financière. Marchés monétaires et théories de l'inflation. Marché du travail et types de chômage. Modèles de long et de court termes. Modèle IS-LM; fluctuations économiques.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN1070": {"name": "ECN 1070 - Techniques d'analyse économique 1", "description": "Représentations fonctionnelles des relations économiques. Calcul différentiel, intégration et applications économiques. Théorème des fonctions implicites. Calcul matriciel et applications économiques. Analyse statique comparée.", "prereqs": 0}, "ECN1075": {"name": "ECN 1075 - Techniques d'analyse économique 2", "description": "Problèmes d'optimisation économique sans et avec contraintes. Méthode de Lagrange. Méthode de Kuhn-Tucker. Applications économiques de l'intégration. Méthodes d'analyse dynamique en économique. Stabilité de l'équilibre.  Remarques: Travaux pratiques.", "prereqs": ["ECN1070", "MAT1400"]}, "ECN1160": {"name": "ECN 1160 - Analyse des données économiques", "description": "Sources des données économiques. Méthodes élémentaires d'analyse. Méthodes de sondages. Recensements et enquêtes. Initiation à un logiciel d'analyse des données économiques.  Remarques: Cours aussi offert en ligne.", "prereqs": 0}, "ECN1260": {"name": "ECN 1260 - Économétrie 1", "description": "Objet, utilité et méthodes de l'économétrie. Notions de statistiques et de probabilités. Problèmes d'inférence statistique. Le modèle de régression simple : signification et utilisation.  Remarques: Travaux pratiques.", "prereqs": 0}, "ECN1350": {"name": "ECN 1350 - Histoire économique du monde occidental", "description": "Ce cours pose les questions suivantes. Comment la taille des unités politiques et le degré de décentralisation de leur vie économique ont-ils changé ? Quelle relation y a-t-il entre ces changements et les innovations technologiques ?", "prereqs": 0}, "ECN1600": {"name": "ECN 1600 - Histoire de la pensée économique", "description": "Analyse des moments qui, dans l'histoire de la pensée économique, se sont avérés les plus significatifs pour l'intelligence des concepts et des problématiques caractéristiques des diverses tendances de l'économie actuelle.", "prereqs": []}, "ECN1700": {"name": "ECN 1700 - Économie et mondialisation", "description": "Ce cours vise à fournir aux étudiants une meilleure compréhension des enjeux de la mondialisation à l'aide d'une analyse basée sur une approche économique.", "prereqs": 0}, "ECN1800": {"name": "ECN 1800 - Économies nord-américaines", "description": "Éléments d'histoire économique nord-américaine; secteurs d'activités : primaire, secondaire, tertiaire; technologie de l'information et nouvelle économie.", "prereqs": 0}, "ECN1966": {"name": "ECN 1966 - Économie du monde arabe", "description": "Vue globale des structures et des perspectives économiques arabes. Analyse de politiques économiques nationales. Examen de politiques de cartellisation et d'intégration poursuivies par les économies arabes.", "prereqs": []}, "ECN1967": {"name": "ECN 1967 - Économie de l'Europe", "description": "Indicateurs économiques. Structures industrielles. Sources et causes du développement économique de l'Europe. Communauté économique européenne et système monétaire européen.", "prereqs": 0}, "ECN1971": {"name": "ECN 1971 - Économie de l'Amérique latine", "description": "Grandes étapes du développement économique de l'Amérique latine. Rôle des institutions économiques nationales et internationales. Ratios financiers associés à la gestion des dettes nationales.", "prereqs": 0}, "ECN2015": {"name": "ECN 2015 - Comportements stratégiques", "description": "Initiation à la pensée stratégique. Environnements stratégiques : problèmes d'engagement et de crédibilité, coopération et coordination.  Incitations.  Applications économiques.", "prereqs": ["ECN1000"]}, "ECN2040": {"name": "ECN 2040 - Théorie microéconomique 1", "description": "Théorie de la décision; choix des consommateurs et théorie de la demande; choix des producteurs et théorie de l'offre; marchés concurrentiels; équilibres partiel et général; bien-être et efficacité.", "prereqs": ["ECN1040", "ECN1075", "MAT1400"]}, "ECN2045": {"name": "ECN 2045 - Théorie microéconomique 2", "description": "Économie de l'incertain : choix en incertitude; marchés des actifs financiers : équilibre; éléments de théorie des jeux; concurrence imparfaite; modèle principal-agent.", "prereqs": ["ECN2040"]}, "ECN2050": {"name": "ECN 2050 - Théorie macroéconomique 1", "description": "Modèle IS-LM en économie fermée et en économie ouverte; fluctuations des taux de change; marché du travail et offre globale; courbe de Phillips.", "prereqs": ["ECN1050", "ECN1075", "MAT1400"]}, "ECN2055": {"name": "ECN 2055 - Théorie macroéconomique 2", "description": "Comportement d'optimisation intertemporelle des ménages et des firmes; décisions de consommation et d'épargne; modèles de croissance et de convergence; politiques gouvernementales et influence de l'endettement public.", "prereqs": ["ECN2050"]}, "ECN2160": {"name": "ECN 2160 - Économétrie 2", "description": "La régression multiple : hypothèses de base, estimation par moindres carrés ordinaires et maximum de vraisemblance, propriétés des estimateurs. Quelques extensions du modèle. Modèles de choix discrets. Exemples d'application.    Remarques: Travaux pratiques.", "prereqs": ["ECN1070", "MAT1400", "ECN1260", "MAT1978", "STT1700"]}, "ECN2165": {"name": "ECN 2165 - Comptabilité 1", "description": "Le modèle comptable : fondements théoriques et fonctionnement pratique, adaptation aux formes juridiques d'entreprises. Concept économique de la valeur et du profit vs théories classiques de la comptabilité. Introduction à la comptabilité nationale.", "prereqs": 0}, "ECN2230": {"name": "ECN 2230 - Institutions et marchés financiers", "description": "Monnaie et régimes monétaires. Les marchés financiers et la réglementation. Instruments financiers. Opérations bancaires. Gestion monétaire. Marchés des changes. Marchés boursiers.", "prereqs": ["ECN1000"]}, "ECN2260": {"name": "ECN 2260 - Économétrie appliquée", "description": "Analyse des données économiques. Le cours fait le pont entre la théorie et la pratique, aide à comprendre les problèmes de spécification et d'estimation des modèles économétriques.   Remarques : Utilisation de logiciels.", "prereqs": ["ECN2160", "ECN2050", "ECN2040"]}, "ECN2311": {"name": "ECN 2311 - Problèmes économiques contemporains", "description": "Ce cours examine certains aspects de la réalité économique contemporaine aux niveaux international, nord-américain et canadien.", "prereqs": ["ECN1000", "ECN1050"]}, "ECN2405": {"name": "ECN 2405 - Économie du développement", "description": "Principaux enjeux du développement économique: croissance et inégalités, éducation, microcrédit, commerce international, politiques de développement.", "prereqs": ["ECN1000"]}, "ECN2450": {"name": "ECN 2450 - Économie urbaine et régionale", "description": "A) Théorie de la localisation. B) Le phénomène régional. C) Le phénomène urbain.", "prereqs": ["ECN1000"]}, "ECN2565": {"name": "ECN 2565 - Introduction à l'économie industrielle", "description": "Concepts et modèles de la structure, du comportement et de la performance industrielle. Théorie de l'oligopole. Barrières à l'entrée. Normes pour la politique. Politique de concurrence canadienne, réglementation, sociétés d'État...", "prereqs": ["ECN1000", "ECN1040"]}, "ECN2700": {"name": "ECN 2700 - Relations économiques internationales", "description": "Traits saillants de la structure du commerce et des relations internationales mondiales, balance des paiements, taux de change, théories et politiques commerciales, politique d'aide au développement, intégration commerciale.", "prereqs": ["ECN1000"]}, "ECN2705": {"name": "ECN 2705 - Régulation économique supranationale", "description": "Problèmes de régulation dans un contexte supranational. Examen de la régulation dans des secteurs choisis (brève analyse économique et discussion des institutions internationales).", "prereqs": ["ECN1000"]}, "ECN2800": {"name": "ECN 2800 - Institutions publiques et financières", "description": "Secteur public et parapublic; institutions et marchés financiers; institutions financières internationales.", "prereqs": ["ECN2800", "ECN1000"]}, "ECN2910": {"name": "ECN 2910 - Environnement et ressources naturelles", "description": "Ce cours vise à familiariser les étudiants avec les enjeux économiques associés à l'environnement et à la pollution, à l'écologie et à l'exploitation des ressources naturelles.", "prereqs": ["ECN1000"]}, "ECN2964": {"name": "ECN 2964 - Économie et finances publiques", "description": "Introduction à la théorie des choix publics et des finances publiques. Application aux décisions d'allocation des biens et des services publics. Interaction entre le secteur privé et le secteur public. Gestion budgétaire.", "prereqs": ["ECN1000"]}, "ECN3013": {"name": "ECN 3013 - Choix collectifs", "description": "Analyse axiomatique de l'efficacité, de l'équité et de la décentralisabilité des règles de choix collectifs dans les problèmes de vote, d'allocation de biens privés, de production de biens publics et de partage de coûts.", "prereqs": ["ECN2045"]}, "ECN3055": {"name": "ECN 3055 - Fluctuations économiques", "description": "Évolution des agrégats au cours du cycle. Indicateur du cycle. Modèles discrets de fluctuations. Diagramme de phases. Retard d'adaptation des agrégats au cycle. Cycle et inflation. Stabilisation économique.", "prereqs": ["ECN2055", "ECN3055", "ECN2160"]}, "ECN3064": {"name": "ECN 3064 - Finances publiques", "description": "Raisons d'être du gouvernement. Biens publics. Externalités. Modèles de choix politiques. Fédéralisme financier. Incidence et effets des impôts et taxes. Analyse avantages-coûts.", "prereqs": ["ECN2045"]}, "ECN3065": {"name": "ECN 3065 - Analyse coûts-bénéfices", "description": "Principes fondamentaux de l'analyse coûts-bénéfices de projets privés et publics. Efficacité économique. Équité. Applications économiques.", "prereqs": ["ECN2040"]}, "ECN3105": {"name": "ECN 3105 - Commerce international", "description": "Causes et structure du commerce international : l'influence des technologies, des dotations de facteurs et des modes de concurrence. Politique commerciale : tarifs et quotas, libéralisation des échanges et formation d'unions douanières.", "prereqs": ["ECN2040"]}, "ECN3115": {"name": "ECN 3115 - Finance internationale", "description": "Marché des changes; système monétaire international; mouvements internationaux de capitaux; parités des pouvoirs d'achat et des taux d'intérêt. Ajustement des balances des paiements; intégration financière internationale.", "prereqs": ["ECN2050"]}, "ECN3405": {"name": "ECN 3405 - Développement économique", "description": "Ce cours pose la question : dans quelle mesure le mécanisme du marché peut-il assurer le développement des pays du Tiers-Monde? Les structures internes de ces économies, ainsi que leurs relations externes, sont analysées en détail.", "prereqs": ["ECN2040", "ECN2050"]}, "ECN3505": {"name": "ECN 3505 - Économie du travail", "description": "Offre et demande de travail. Ajustement du marché : chômage, postes vacants, courbe de Phillips, prospection du marché. Syndicalisme et salaire. Contrats implicites. Disparités. Arbitrage. Institutions : salaire minimum, assurance-chômage.", "prereqs": ["ECN2040", "ECN3505", "ECN2160"]}, "ECN3565": {"name": "ECN 3565 - Économie industrielle avancée", "description": "Pouvoir de monopole : nature du produit, discrimination; comportements stratégiques : court terme et long terme, différentiation de produits; information et concurrence; recherche et développement.", "prereqs": ["ECN2040"]}, "ECN3650": {"name": "ECN 3650 - Économie du comportement social", "description": "Étude de phénomènes sociaux : allocation du temps, interaction sociale, théorie économique du crime, de la famille, de la religion. Valeur de la vie. Théorie du capital humain.", "prereqs": ["ECN1260", "MAT1978", "STT1700", "ECN2040"]}, "ECN3705": {"name": "ECN 3705 - Économie de l'assurance", "description": "Théorie économique de l'assurance. Fonctions des marchés de l'assurance et partage du risque. Risque moral et sélection adverse. Assurance publique et privée.", "prereqs": ["ECN2040"]}, "ECN3750": {"name": "ECN 3750 - Inégalité et croissance économiques", "description": "Analyse des questions liées à l'inégalité, la répartition des revenus et la croissance de l'économie. Examen des tendances au fil du temps et dans différents pays. Théories existantes et appuis empiriques.", "prereqs": ["ECN2055", "ECN2160"]}, "ECN3801": {"name": "ECN 3801 - Économie financière", "description": "Introduction à la finance. Étude des décisions d'investissement de la firme. Incorporation de la contrainte financière, de la fiscalité et du risque dans les analyses avantages-coûts des projets privés.", "prereqs": ["ECN1260", "MAT1978", "STT1700", "ECN2040"]}, "ECN3820": {"name": "ECN 3820 - Économie des organisations", "description": "Organisation interne de la firme quant à ses limites, structures et politiques en réponse aux nombreux problèmes d'incitation et de coordination qui l'animent.", "prereqs": ["ECN2045"]}, "ECN3900": {"name": "ECN 3900 - Sujets spéciaux de macro-économie", "description": "Analyse de divers sujets en macro-économie liés à des facteurs d'incertitude tels que les fluctuations de revenu et la dynamique des entreprises. Étude des différents mécanismes économiques et de leur application empirique.", "prereqs": ["ECN2055", "ECN2160"]}, "ECN3910": {"name": "ECN 3910 - Économie de l'environnement", "description": "Problèmes environnementaux. Externalités. Interventions de l'État. Marchés. Taxes. Normes.", "prereqs": ["ECN2045"]}, "ECN3920": {"name": "ECN 3920 - Économie et droit", "description": "Théories économiques du droit. Analyse économique des lois. Réglementation.", "prereqs": ["ECN2040"]}, "ECN3950": {"name": "ECN 3950 - Atelier en économie appliquée", "description": "Le but du cours est d'analyser des questions spécifiques d'économie relatives aux problèmes d'actualité, selon les besoins.", "prereqs": ["ECN2040", "ECN2050", "ECN2160"]}, "ECN3995": {"name": "ECN 3995 - Stage", "description": "Stage en milieu professionnel comportant des éléments significatifs d'analyse économique. L'étudiant doit lui-même proposer et faire approuver son stage avant de s'inscrire à ce cours.", "prereqs": ["ECN2045", "ECN2055", "ECN2160"]}, "ECN4040": {"name": "ECN 4040 - Microéconomie honor", "description": "Éléments avancés de théorie microéconomique; théorie des jeux.    Remarques: Réservé aux étudiants de l'orientation honor. L'étudiant doit avoir réussi au moins 54 cr. du spécialisé en ayant maintenu une moyenne cumulative de 3,3 et en ayant une moyenne cumulative de 3,0 pour l'ensemble des cours ECN 2040 2045 2050 2055 et 2160.", "prereqs": 0}, "ECN4050": {"name": "ECN 4050 - Macroéconomie honor", "description": "Éléments avancés de théorie macroéconomique; marchés réels et monétaires.  Remarques: Réservé aux étudiants de l'orientation honor. L'étudiant doit avoir réussi au moins 54 cr. du spécialisé en ayant maintenu une moyenne cumulative de 3,3 et en ayant une moyenne cumulative de 3,0 pour l'ensemble des cours ECN 2040, 2045, 2050, 2055 et 2160.", "prereqs": 0}, "ECN4070": {"name": "ECN 4070 - Économie mathématique honor", "description": "Éléments avancés de techniques d'analyse économique; optimisation dynamique et statique.  Réservé aux étudiants de l'orientation honor du baccalauréat en sciences économiques et aux étudiants du baccalauréat en mathématique et économie. L'étudiant doit avoir une moyenne cumulative de 3,0 pour l'ensemble des cours ECN 2040, 2045, 2050, 2055 et 2160.", "prereqs": []}, "ECN4160": {"name": "ECN 4160 - Économétrie appliquée honor", "description": "Expérimentation à l'aide d'exemples et en manipulant des données concrètes, des problèmes d'économétrie appliquée dans le cadre de la démarche scientifique. Initiation à la méthodologie des modèles empiriques en sciences humaines et sociales.    Remarques: Réservé aux étudiants de l'orientation honor. L'étudiant doit avoir réussi au moins 54 cr. du spécialisé en ayant maintenu une moyenne cumulative de 3,3 et en ayant une moyenne cumulative de 3 0 pour l'ensemble des cours ECN 2040, 2045, 2050, 2055 et 2160.", "prereqs": 0}, "ECN6233": {"name": "ECN 6233 - Microéconométrie", "description": "Ce cours se penche sur l'analyse des données d'enquête et des données de panel : choix discrets, variables dépendantes limitées, autosélection, choix de régime, modèles de durée et économétrie des données de panel.", "prereqs": 0}, "ECN6238": {"name": "ECN 6238 - Macroéconométrie", "description": "Techniques économétriques applicables aux séries chronologiques : théorie des processus stationnaires (ARMA), analyse spectrale et modèle avec régresseurs non stationnaires.", "prereqs": 0}, "ECN6248": {"name": "ECN 6248 - Sujets spéciaux en macroéconomie et finance", "description": "Ce cours présente une analyse des fluctuations économiques. Le cours s'intéresse entre autres aux causes et effets des crises économiques, aux coûts des fluctuations, aux effets sur la distribution du revenu et à l'endettement public et privé.", "prereqs": ["ECN6118"]}, "ECN6258": {"name": "ECN 6258 - Sujets spéciaux en monnaie, banques et marchés", "description": "Ce cours a pour but de fournir une connaissance pratique des marchés des titres à revenus fixes (marché monétaire, marchés obligataires gouvernementaux, marché des pensions) ainsi que du fonctionnement des banques et autres institutions financières.", "prereqs": 0}, "ECN6473": {"name": "ECN 6473 - Commerce international", "description": "Structure des marchés et commerce international : concurrence parfaite; produits différenciés; barrières tarifaires et non tarifaires; intégration économique; croissance économique.", "prereqs": []}, "ECN6478": {"name": "ECN 6478 - Finance internationale", "description": "Cours portant sur l'ajustement des balances de paiements, sur le fonctionnement des marchés des changes et sur les relations monétaires et financières entre les pays.", "prereqs": []}, "ECN6523": {"name": "ECN 6523 - Économie du travail A", "description": "Fondements théoriques et évidence empirique sur le fonctionnement du marché du travail en libre concurrence : offre et demande de travail et équilibre de marché, éducation, formation de la main-d'oeuvre, distribution des revenus, etc.", "prereqs": 0}, "ECN6573": {"name": "ECN 6573 - Économie financière", "description": "Risque, aversion pour le risque, dominance stochastique, choix de portefeuille, modèles d'évaluation des actifs financiers. Incertitude en temps continu, structure à terme des taux d'intérêt. Évaluation risque neutre, options, modèles Black-Scholes.", "prereqs": 0}, "ECN6578": {"name": "ECN 6578 - Économétrie des marchés financiers", "description": "Prévisibilité des rendements, relations de valeur actualisée, évaluation des actifs financiers, modèles d'équilibre intertemporels, estimation et tests de la structure à terme des taux, nonlinéarités des données financières, prix des titres dérivés.", "prereqs": 0}, "ECN6623": {"name": "ECN 6623 - Organisation industrielle A", "description": "Analyse de la concurrence importante, comportements stratégiques pour acquérir et préserver une dominance du marché, fusionnements, lois sur la concurrence.", "prereqs": 0}, "ECN6643": {"name": "ECN 6643 - Concurrence et réglementation", "description": "Ce cours utilise les modèles théoriques d'organisation industrielle pour examiner l'impact des interventions gouvernementales et des lois sur la concurrence et la réglementation sur les marchés.", "prereqs": ["ECN6013"]}, "ECN6823": {"name": "ECN 6823 - Économie publique (taxation)", "description": "Étude des effets économiques des impôts et taxes levés par les gouvernements. L'accent est mis sur les effets de la taxation dans le contexte canadien et américain.", "prereqs": []}, "ECN6828": {"name": "ECN 6828 - Économie publique (dépenses)", "description": "Coopérations, conflit et institutions publiques : décisions collectives; biens publics; clubs; bureaucratie; équilibre et efficacité du secteur public.", "prereqs": []}, "ECN6873": {"name": "ECN 6873 - Évaluation de projets", "description": "Principes et techniques d'analyse avantages - coûts économiques. Projets publics, entreprises gouvernementales et environnement.", "prereqs": 0}, "ECN6878": {"name": "ECN 6878 - Choix d'investissement", "description": "Techniques d'évaluation des investissements réels en contexte stochastique. Valeur d'option et investissement réels. Règles d'investissement optimal. Investissement séquentiel. Investissement incrémental et choix de capacité. Décisions entrée-sortie.", "prereqs": []}, "ESP1901": {"name": "ESP 1901 - Espagnol 1 (niveau A1)", "description": "Communiquer dans des situations simples. Acquisition de vocabulaire, des principes de la prononciation et de structures grammaticales de base. Exercices d'écriture. Sensibilisation à la culture hispanique.  Remarques: Approches pédagogiques mixtes axées sur la communication. Le test de classement est OBLIGATOIRE pour tous les étudiants désirant s'inscrire à un cours d'espagnol (incluant le niveau débutant).", "prereqs": []}, "ESP1902": {"name": "ESP 1902 - Espagnol 2 (niveau A2)", "description": "Communiquer dans des situations familières. Compréhension de lectures et de conversations simples. Compositions. Sensibilisation à la culture hispanique.  Remarques: Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ESP1902", "ESP1901"]}, "ESP1903": {"name": "ESP 1903 - Espagnol 3 (niveau B1.1)", "description": "Communiquer dans des domaines d'intérêt personnel. Compréhension de discussions sur des sujets divers. Rédactions. Lecture d'un livre court. Approfondissement de la connaissance des pays hispaniques.  Remarques: 1re partie du niveau B1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ESP1903", "ESP1902"]}, "ESP1904": {"name": "ESP 1904 - Espagnol 4 (niveau B1.2)", "description": "Communiquer dans des domaines d'intérêt personnel et professionnel. Compréhension d'émissions radiophoniques et télévisées. Rédactions. Lecture d'un livre. Discussion des enjeux des pays hispaniques.  Remarques: 2e partie du niveau B1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["ESP1904", "ESP1903"]}, "GEO2222": {"name": "GEO 2222 - Géographie économique", "description": "Structure et dynamique géographique des activités économiques. Différents débats théoriques sur la localisation et le fonctionnement des activités économiques. Flux et interrelations entre activités. Activités économiques et développement.", "prereqs": []}, "HST2443": {"name": "HST 2443 - Le Canada et le Québec dans le monde", "description": "Survol de l'histoire internationale du Canada et du Québec de l'ère confédérale au tournant du 21e siècle. Analyse des dimensions culturelles, économiques et politiques de la participation des Canadiens et des Québécois au système international.", "prereqs": 0}, "HST2820": {"name": "HST 2820 - La mondialisation depuis 1850", "description": "Étude du développement de la mondialisation et des institutions mondiales et de certains effets (distribution des revenus, mode de production, normes de consommation, profils démographiques et évolution de la famille).", "prereqs": []}, "HST3450": {"name": "HST 3450 - Histoire économique nord-américaine", "description": "Analyse historique des grandes transformations économiques des sociétés nord-américaines, des découvertes à nos jours.", "prereqs": 0}, "IFT1800": {"name": "IFT 1800 - Initiation à l'informatique", "description": "Information et informatique. Concepts et vocabulaire de base. Matériel et logiciels. Ordinateur : structure et fonctionnement. Logiciels système et d'application.  Remarques: Travaux pratiques sur les progiciels les plus répandus.", "prereqs": 0}, "IFT1990": {"name": "IFT 1990 - Informatique pour sciences sociales", "description": "Initiation aux micro-ordinateurs. Concepts et vocabulaire. Logiciels et matériel. Traitement de l'information. Utilisation d'Internet. Gestion de bases de données. Logiciel de traitement statistique. Analyse qualitative et quantitative de données.", "prereqs": 0}, "JPN1901": {"name": "JPN 1901 - Japonais 1 (niveau A1.1)", "description": "Communiquer dans des situations très simples. Exercices d'écriture et de conversation. Acquisition de vocabulaire et de structures très simples, des principes de la prononciation et de la formation des mots. Sensibilisation à la culture japonaise.    Remarques: 1re partie du niveau A1. Approches pédagogiques mixtes axées sur la communication. Seuls les étudiants n'ayant aucune connaissance de la langue japonaise seront admis dans ce cours.", "prereqs": 0}, "JPN1902": {"name": "JPN 1902 - Japonais 2 (niveau A1.2)", "description": "Communiquer dans des situations simples. Exercices d'écriture et de conversation. Acquisition de vocabulaire et de structures simples, des principes de la prononciation et de la formation des mots. Sensibilisation à la culture japonaise.    Remarques:\t2e partie du niveau A1. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["JPN1902", "JPN1901"]}, "JPN1903": {"name": "JPN 1903 - Japonais 3 (niveau A1+)", "description": "Communiquer dans des situations simples. Exercices d'écriture et lecture de courts textes. Consolidation du vocabulaire et de la grammaire de base. Sensibilisation à la culture japonaise.    Remarques:\t3e partie du niveau A1. Approches pédagogiques mixtes axées sur l'analyse.", "prereqs": ["JPN1050", "JPN1050", "JPN1902"]}, "JPN1904": {"name": "JPN 1904 - Japonais 4 (niveau A2.1)", "description": "Communiquer dans quelques situations familières. Enrichissement du vocabulaire et approfondissement de la grammaire de base. Exercices d'écriture et lecture de courts textes. Conversation. Familiarisation avec la culture japonaise.    Remarques:\t1re partie du niveau A2. Approches pédagogiques mixtes axées sur la communication.", "prereqs": ["JPN1904", "JPN1903"]}, "MAT1400": {"name": "MAT 1400 - Calcul 1", "description": "Suites, séries. Fonctions de plusieurs variables, continuité, dérivées partielles, différentielles, plan tangent, dérivation en chaîne. Gradient, surfaces de niveau, extremums. Intégrales multiples, changement de variables, jacobien.", "prereqs": 0}, "MAT1600": {"name": "MAT 1600 - Algèbre linéaire", "description": "Systèmes d'équations linéaires, élimination de Gauss, inverse matricielle. Espace vectoriel, indépendance linéaire, transformations linéaires, changement de base. Produit scalaire. Déterminants. Diagonalisation. Exemples d'applications.", "prereqs": 0}, "MAT1978": {"name": "MAT 1978 - Probabilités et statistique", "description": "Probabilités, indépendance. Variables aléatoires. Espérance. Lois de probabilité. Vecteurs aléatoires. Loi des grands nombres, théorème limite central. Intervalles de confiance. Régression linéaire. Test du khi-deux.  Remarques: Cours pour informaticiens.", "prereqs": ["IFT1063", "IFT1065", "MAT1400"]}, "PHI1130": {"name": "PHI 1130 - Philosophie des sciences", "description": "La science comme entreprise rationnelle : spécificité de l'explication scientifique. Notions d'hypothèse, de loi, de théorie. Le développement de la science : modèles continuistes et discontinuistes.", "prereqs": 0}, "PHI1400": {"name": "PHI 1400 - Problèmes en éthique", "description": "Analyse des principales notions (droit, obligation, bien-être, égalité...) et des principaux problèmes (euthanasie, inégalité sociale, environnement...) de l'éthique philosophique contemporaine.", "prereqs": 0}, "POL1000": {"name": "POL 1000 - Fondements de science politique", "description": "Initiation aux concepts, aux théories et aux auteurs qui fondent la science politique, ainsi qu’aux principaux objets et phénomènes étudiés dans cette discipline.", "prereqs": 0}, "POL1600": {"name": "POL 1600 - Relations internationales", "description": "La phénoménalité des relations internationales et son encadrement théorique. Le système international actuel. Les États et leur politique étrangère. Les organisations internationales : typologie générale. Les forces transnationales : étude de cas.  Remarques: Cours en ligne. Des séances de travaux pratiques seront données en classe.", "prereqs": ["POL1600", "POL1605", "POL1954"]}, "POL1953": {"name": "POL 1953 - Institutions politiques Canada - Québec", "description": "Origines du régime constitutionnel canadien. Position du Québec dans la fédération. Les structures institutionnelles; la législature, le processus électoral, les formations politiques, le gouvernement, l'administration, le judiciaire.  Remarques: cours non admissible pour les étudiants des programmes de science politique.", "prereqs": ["POL1020", "POL1020", "POL1953"]}, "PSY1075": {"name": "PSY 1075 - Psychologie sociale", "description": "Théories, méthodes et postulats de base. Influence des facteurs sociaux sur l'individu. Processus interpersonnels. Processus de groupe. Psychologie sociale et problèmes contemporains.", "prereqs": 0}, "QCF1050": {"name": "QCF 1050 - Introduction au Québec", "description": "Le but du cours est de confronter et d'intégrer, en autant que possible, diverses approches (historique, sociologique, littéraire, etc.) de la réalité québécoise.", "prereqs": 0}, "REI1010": {"name": "REI 1010 - Introduction aux relations industrielles", "description": "Champ d'études: relations du travail, gestion des ressources humaines et politiques publiques du travail. Constitution et évolution des relations industrielles sur le plan théorique. Les acteurs: rôles, objectifs, structures et activités.", "prereqs": ["REI1010", "REI1010"]}, "REI2475": {"name": "REI 2475 - Politiques gouvernementales en R.I.", "description": "Perspectives théoriques et historiques des politiques gouvernementales en relations industrielles. Rôle des acteurs socioéconomiques. Analyse des grandes politiques publiques contemporaines en relations industrielles au Québec et au Canada.", "prereqs": ["REI2470", "ECN1000", "ECN1050", "REI2475", "REI2475"]}, "SOL1970": {"name": "SOL 1970 - Sociologie du Québec", "description": "Organisation sociale et culture de la province de Québec.", "prereqs": ["SOL1003", "SOL1970", "SOL1970"]}}