{"ACT1240": {"name": "ACT 1240 - Mathématiques financières", "description": "Mesures d'intérêt, valeurs présentes, accumulées, annuités certaines à paiements égaux et non-égaux, remboursement des prêts, obligations, flux monétaires généraux et portefeuilles, duration, immunisation, déterminants des taux d’intérêt.", "prereqs": ["ACT1240", "MAT1240"]}, "ACT2241": {"name": "ACT 2241 - Produits dérivés et gestion de risque", "description": "Options d'achat/vente, contrats à terme/à livrer, stratégies de gestion des risques, évaluation d'options, parité, arbitrage, modèle binomial, modèle de Black-Scholes, couverture dynamique.", "prereqs": ["ACT1240"]}, "ACT2242": {"name": "ACT 2242 - Finance corporative", "description": "Concepts de comptabilité et règlementation. Préparation et analyse d’états financiers. Calcul de ratios financiers. Coût de la dette et coût des capitaux propres. Décision d'investissement. Structure du capital, modèle M&M.", "prereqs": ["ACT1240"]}, "ACT2243": {"name": "ACT 2243 - Investissements", "description": "Marchés financiers et actifs financiers qui s'y transigent (actions, titres à revenu fixe). Construction de portefeuilles, frontière efficace. Modèle CAPM. Efficience des marchés et finance comportementale. Mesures de risque.", "prereqs": ["ACT1240"]}, "ACT2250": {"name": "ACT 2250 - Mathématiques de l'assurance-vie 1", "description": "Assurances à long terme, fonction de survie, probabilités de décès, force de mortalité, tables de mortalité, hypothèses pour âges fractionnaires, assurance-vie, rentes viagères, perte de l’assureur, calcul des primes périodiques nettes et brutes.", "prereqs": ["ACT1240", "MAT1720"]}, "ACT2251": {"name": "ACT 2251 - Mathématiques de l'assurance-vie 2", "description": "Réserves pour bénéfices; formules prospectives, rétrospective, récursive; réserves modifiées. Vies conjointes, dernier survivant; assurance, rente sur 2 vies; modèles à décréments multiples et applications.", "prereqs": ["ACT2250"]}, "ACT2284": {"name": "ACT 2284 - Mathématiques de l'assurance IARD", "description": "Théorie de l’estimation et de la sélection de modèles paramétriques. Théorie de la crédibilité. Tarification et réserves.", "prereqs": ["ACT3251", "STT2700"]}, "ACT3201": {"name": "ACT 3201 - Régimes de retraite", "description": "Système canadien de régimes de retraite publics et privés. Types de régimes privés. Calcul de rentes. Principe de capitalisation. Méthodes actuarielles d'évaluation, hypothèses, gains et pertes. Contexte législatif.", "prereqs": ["ACT2250"]}, "ACT3230": {"name": "ACT 3230 - Finance mathématique", "description": "Notions de probabilités et calcul stochastique, théorie de l’arbitrage, théorèmes fondamentaux, modèles binomiaux, modèle de Black-Scholes, modèles pour taux d’intérêt, calibration de modèles aux données de marché.", "prereqs": ["ACT2241", "MAT2717"]}, "ACT3251": {"name": "ACT 3251 - Théorie du risque", "description": "Modèles de fréquence et de sévérité des sinistres, modèles collectifs, distribution des pertes totales. Types de contrat d’assurance et de réassurance IARD. Effet de modifications de couverture.", "prereqs": ["MAT1720"]}, "ACT3253": {"name": "ACT 3253 - Gestion des risques", "description": "Types de risques traditionnels et non traditionnels (ex. risque d’entreprise, risques environnementaux). Méthodes qualitatives et quantitatives d’évaluation et de gestion des risques.", "prereqs": ["ACT2250", "ACT3251"]}, "ACT3261": {"name": "ACT 3261 - Modélisation prédictive", "description": "Techniques de description et de visualisation de données. Applications de modèles linéaires généralisés et d’arbres de décision. Techniques de regroupement de données. Communication et vulgarisation des résultats.", "prereqs": ["ACT3251", "STT3790"]}, "ACT3281": {"name": "ACT 3281 - Laboratoire d'actuariat", "description": "Étude de problèmes complexes en actuariat. Codes de conduite professionnelle. Présentation orale et travaux sur ordinateurs.", "prereqs": ["ACT2250", "ACT3251"]}, "ACT3282": {"name": "ACT 3282 - Laboratoire de mathématiques financières", "description": "Étude de problèmes complexes en mathématiques financières. Communication des résultats", "prereqs": ["ACT3230"]}, "ACT4000": {"name": "ACT 4000 - Mémoire de fin d’études", "description": "Un projet est suggéré à chaque étudiant lui permettant de faire une synthèse de ses connaissances en actuariat ou mathématiques financières. L’étudiant soumet un rapport et fait un exposé oral à la fin du trimestre.", "prereqs": []}, "BIO1203": {"name": "BIO 1203 - Introduction à la génétique", "description": "Loi de Mendel et mécanismes de l'hérédité. Linkage génétique et recombinaison. Probabilités et génétique. Éléments de cytogénétique. Mutations. Applications en biotechnologie et impact social.", "prereqs": 0}, "BIO1803": {"name": "BIO 1803 - Écologie et environnement", "description": "Organisation générale de la biosphère, dynamique de l'environnement physique, histoire de la biosphère, populations et communautés, les grands types d'écosystèmes, l'homme dans la biosphère.", "prereqs": 0}, "BIO2811": {"name": "BIO 2811 - Dynamique des populations", "description": "Processus responsables des variations temporelles de l'abondance des populations animales et végétales. Description et utilisation de modèles mathématiques visant à quantifier et prédire les variations de l'abondance des populations.", "prereqs": ["BIO1803"]}, "BIO3115": {"name": "BIO 3115 - Principes de phylogénie et systématique", "description": "Introduction aux principes, méthodes et applications de la systématique: reconstruction phylogénétique, systématique moléculaire, applications en biologie de l'évolution, pour la classification taxonomique, la biogéographie et l'écologie.  Remarques: Actif au trimestre d'hiver des années impaires. Cours cyclique non offert en 2015-2016.", "prereqs": ["BIO1203", "BIO3115", "BIO2115"]}, "DMO1000": {"name": "DMO 1000 - Introduction à la démographie", "description": "Introduction aux phénomènes majeurs modifiant les populations humaines, dans leur structure et dans leur mouvement : fécondité, nuptialité, mortalité, migration. Histoire des populations et croissance démographique. Perspectives de populations.", "prereqs": ["DMO1000", "DMO1010", "DMO6050"]}, "DMO2200": {"name": "DMO 2200 - Sources de données", "description": "Recensements canadiens et données d'état civil au Québec; implications pour l'analyse; comparaison avec d'autres pays, dont certains du Tiers-Monde. Enquête démographique. Enjeux éthiques.   Remarques: Travaux pratiques avec les données et les métadonnées disponibles sur Internet.", "prereqs": 0}, "DMO2311": {"name": "DMO 2311 - Analyse longitudinale", "description": "Méthodes d'analyse longitudinale : application à la mortalité, fécondité, nuptialité, migration. Construction de tables démographiques. Histoire d'une promotion de mariages.", "prereqs": ["DMO1000"]}, "DMO2312": {"name": "DMO 2312 - Analyse transversale", "description": "Méthodes d'analyse transversale : application à la mortalité, fécondité, nuptialité, migration. Construction de tables de mortalité. Structure et renouvellement des populations. Modèles et éléments de perspectives de population.", "prereqs": ["DMO2311"]}, "DMO3307": {"name": "DMO 3307 - Pratique de la démographie", "description": "Pratique de la démographie. Perspectives de population : modèles de base et modèles adaptés aux sous-populations. Applications à divers milieux de pratique : éducation, santé, population active, immigration, et autres.", "prereqs": ["DMO2311"]}, "ECN1000": {"name": "ECN 1000 - Principes d'économie", "description": "Présentation des outils de base de l'analyse économique : coût d'opportunité, offre, demande et prix; choix des consommateurs; choix de production des firmes; marchés concurrentiels; monopole; efficacité; commerce international.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN1040": {"name": "ECN 1040 - Introduction à la microéconomie", "description": "Éléments de finance : décisions d'épargne et marchés financiers; concurrence imparfaite : progrès technologique et informations imparfaites; rôle de l'État : environnement, efficacité, équité.", "prereqs": ["ECN1000"]}, "ECN1050": {"name": "ECN 1050 - Introduction à la macroéconomie", "description": "Interdépendance des marchés et comptabilité nationale et financière. Marchés monétaires et théories de l'inflation. Marché du travail et types de chômage. Modèles de long et de court termes. Modèle IS-LM; fluctuations économiques.    Remarques: Cours aussi offert en ligne", "prereqs": 0}, "ECN2040": {"name": "ECN 2040 - Théorie microéconomique 1", "description": "Théorie de la décision; choix des consommateurs et théorie de la demande; choix des producteurs et théorie de l'offre; marchés concurrentiels; équilibres partiel et général; bien-être et efficacité.", "prereqs": ["ECN1040", "ECN1075", "MAT1400"]}, "ECN2045": {"name": "ECN 2045 - Théorie microéconomique 2", "description": "Économie de l'incertain : choix en incertitude; marchés des actifs financiers : équilibre; éléments de théorie des jeux; concurrence imparfaite; modèle principal-agent.", "prereqs": ["ECN2040"]}, "ECN2050": {"name": "ECN 2050 - Théorie macroéconomique 1", "description": "Modèle IS-LM en économie fermée et en économie ouverte; fluctuations des taux de change; marché du travail et offre globale; courbe de Phillips.", "prereqs": ["ECN1050", "ECN1075", "MAT1400"]}, "ECN2165": {"name": "ECN 2165 - Comptabilité 1", "description": "Le modèle comptable : fondements théoriques et fonctionnement pratique, adaptation aux formes juridiques d'entreprises. Concept économique de la valeur et du profit vs théories classiques de la comptabilité. Introduction à la comptabilité nationale.", "prereqs": 0}, "ECN3801": {"name": "ECN 3801 - Économie financière", "description": "Introduction à la finance. Étude des décisions d'investissement de la firme. Incorporation de la contrainte financière, de la fiscalité et du risque dans les analyses avantages-coûts des projets privés.", "prereqs": ["ECN1260", "MAT1978", "STT1700", "ECN2040"]}, "GEO1312": {"name": "GEO 1312 - Développement durable et environnement", "description": "Initiation au développement durable et à l'environnement : pressions environnementales, état de l'environnement, réponses sociales. Thèmes traités: population, agriculture, énergie, déchets, pollution des milieux, changements climatiques, biodiversité.", "prereqs": 0}, "GEO2122": {"name": "GEO 2122 - Climatologie", "description": "Introduction aux processus météorologiques fondamentaux qui régissent le climat. Les grands types de climat, leur répartition spatiale et leur évolution dans le temps. Ajustements au doublement du CO2 atmosphérique.", "prereqs": []}, "GEO2152": {"name": "GEO 2152 - Hydrologie", "description": "Introduction à la science de l'hydrologie par un examen des processus physiques qui composent le cycle hydrologique. Analyse conceptuelle et physique des processus.", "prereqs": []}, "HOR1200": {"name": "HOR 1200 - Horizon: Risques et défis du XXIe siècle", "description": "Approche interdisciplinaire de résolution d'un enjeu de société. Mise en application de compétences transversales (résolution de problèmes complexes, gestion de projet, communication, etc.) Thématiques varient annuellement.", "prereqs": 0}, "IFT1015": {"name": "IFT 1015 - Programmation 1", "description": "Éléments de base d'un langage de programmation : types, expressions, énoncés conditionnels et itératifs, procédures, fonctions, paramètres, récursivité, tableaux, enregistrements, pointeurs et fichiers.", "prereqs": 0}, "IFT1025": {"name": "IFT 1025 - Programmation 2", "description": "Concepts avancés : classes, objets, héritage, interfaces, réutilisation, événements. Introduction aux structures de données et algorithmes : listes, arbres binaires, fichiers, recherche et tri. Notions d'analyse numérique : précision.", "prereqs": ["IFT1015", "IFT1016"]}, "IFT1174": {"name": "IFT 1174 - Chiffrier, bases de données et programmation VBA", "description": "Traitement d'ensembles de données au moyen d'un chiffrier électronique et d'un système de gestion de base de données. Automatisation et adaptation de différents traitements sur ces données en utilisant la programmation en VBA.", "prereqs": 0}, "IFT1575": {"name": "IFT 1575 - Modèles de recherche opérationnelle", "description": "Programmation linéaire. Simplexe. Dualité. Programmation en nombres entiers. Problèmes de réseaux. Méthodes PERT/CPM. Plus court chemin. Programmation dynamique déterministe et probabiliste. Modèles stochastiques.", "prereqs": 0}, "IFT2015": {"name": "IFT 2015 - Structures de données", "description": "Types abstraits pour les structures de données, arbres, dictionnaires, files avec priorités, graphes, méthodes externes.", "prereqs": ["IFT1025", "IFT1065"]}, "IFT2105": {"name": "IFT 2105 - Introduction à l'informatique théorique", "description": "Automates finis et expressions régulières. Grammaires hors-contexte et automates à piles. Calculabilité et décidabilité. Classes de complexité.", "prereqs": ["IFT1015", "IFT1065"]}, "IFT2125": {"name": "IFT 2125 - Introduction à l'algorithmique", "description": "Conception et analyse d'algorithmes. Notation asymptotique, résolution de récurrences. Algorithmes voraces, diviser-pour-régner, programmation dynamique, parcours de graphes, retour-arrière, algorithmes probabilistes.", "prereqs": ["IFT2125", "IFT2015", "MAT1978", "MAT1720"]}, "IFT2425": {"name": "IFT 2425 - Introduction aux algorithmes numériques", "description": "Arithmétique en point flottant, analyse d'erreurs. Équations linéaires et non linéaires. Interpolation, moindres carrés. Différenciation et intégration numérique. Équations différentielles ordinaires.", "prereqs": ["IFT1015", "MAT1400", "MAT1600"]}, "IFT2455": {"name": "IFT 2455 - Analyse numérique matricielle", "description": "Solution numérique des systèmes d'équations linéaires; inversion; triangularisation. Méthodes directes, méthodes d'itération, etc. Approximation des valeurs propres. Applications diverses.", "prereqs": ["IFT1015", "MAT1600"]}, "IFT2505": {"name": "IFT 2505 - Optimisation linéaire", "description": "Modèles linéaires. Méthode du simplexe. Dualité. Postoptimisation. Analyse de sensibilité. Problèmes à structures particulières. Modèles en nombres entiers. Méthodes de coupes. Séparation et évaluation progressive.", "prereqs": ["MAT1600"]}, "IFT3155": {"name": "IFT 3155 - Informatique quantique", "description": "Calcul réversible; information quantique; non-localité; cryptographie quantique; circuits, parallélisme et interférence quantiques; algorithmes de Simon, Shor et Grover; téléportation; correction d'erreurs; implantation.", "prereqs": []}, "IFT3205": {"name": "IFT 3205 - Traitement du signal", "description": "Systèmes linéaires. Échantillonnage et reconstruction. Convolution. Notation polaire. Transformées-Z et de Fourier. Analyse spectrale. Filtrage numérique (FIR et IIR). Applications dans les domaines de l'audio, de l'image et de la vidéo.", "prereqs": ["MAT1400", "MAT1600", "IFT3205", "IFT3200"]}, "IFT3245": {"name": "IFT 3245 - Simulation et modèles", "description": "Modèles de simulation. Simulations continues et à événements discrets. Modélisation stochastique. Validation et réalisme. Analyse des résultats. Technique de réduction de la variance. Génération de valeurs pseudoaléatoires.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "PHY2215", "IFT3245", "IFT3240"]}, "IFT3355": {"name": "IFT 3355 - Infographie", "description": "2D : tracé, remplissage. 3D : transformations, projections. Surfaces cachées. Illumination : modèles de réflexion. Textures : antialiassage. Modélisation : surfaces paramétriques. Animation : interpolation, cinématique, dynamique.", "prereqs": ["IFT2015", "IFT3355", "IFT3350"]}, "IFT3395": {"name": "IFT 3395 - Fondements de l'apprentissage machine", "description": "Éléments de base des algorithmes d'apprentissage statistique et symbolique. Exemples d'applications en forage de données, reconnaissance des formes, régression non linéaire, et données temporelles.  Remarques: Des connaissances d'analyse numérique sont recommandées, par exemple le IFT 2425.", "prereqs": ["MAT1600", "MAT1978", "IFT2125", "IFT3395", "IFT3390"]}, "IFT3515": {"name": "IFT 3515 - Optimisation non linéaire", "description": "Programmation non linéaire. Conditions d'optimalité avec et sans contraintes. Méthodes de directions de descente, de Newton et quasi-Newton. Méthodes de recherche linéaire et de régions de confiance. Méthode de points intérieurs.", "prereqs": ["MAT1600"]}, "IFT3545": {"name": "IFT 3545 - Graphes et réseaux", "description": "Introduction à la théorie des graphes et à ses applications en informatique. Arborescences, connexité, coloriages, stabilité. Algorithmes sur les graphes. Applications.", "prereqs": ["IFT3545", "IFT3540"]}, "IFT3700": {"name": "IFT 3700 - Introduction à la science des données", "description": "Mise en contexte et applications des probabilités, statistiques, optimisation et outils informatiques pour la science des données; nettoyage et visualisation de données; enjeux statistiques de l'apprentissage automatique sur données structurées.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "STT1700"]}, "MAT1000": {"name": "MAT 1000 - Analyse 1", "description": "Propriétés des nombres réels, concepts topologiques dans R, suites et séries numériques, propriétés des fonctions continues et fonctions dérivables d'une variable réelle à valeurs réelles.", "prereqs": 0}, "MAT1101": {"name": "MAT 1101 - Mathématiques fondamentales", "description": "Axiomes de Peano. Principe d'induction. Algorithme d'Euclide. Nombres entiers, rationnels, réels. Nombres algébriques, transcendants. Cardinaux. Nombres complexes. Théorème fondamental de l'algèbre.", "prereqs": 0}, "MAT1301": {"name": "MAT 1301 - Mathématiques élémentaires", "description": "Axiomatisation des entiers. Induction mathématique. Bases de numération et écriture d'un nombre réel dans une base. Théorie des graphes et applications. Lieux géométriques. Droites et cercles. Coniques et applications.", "prereqs": 0}, "MAT1332": {"name": "MAT 1332 - Géométrie euclidienne", "description": "Géométrie euclidienne dans le plan: figures semblables, aires planes. Éléments de géométrie dans l'espace: droites et plans, polyèdres, corps ronds. Systèmes d'axiomes et introduction aux géométries non euclidiennes.", "prereqs": 0}, "MAT1400": {"name": "MAT 1400 - Calcul 1", "description": "Suites, séries. Fonctions de plusieurs variables, continuité, dérivées partielles, différentielles, plan tangent, dérivation en chaîne. Gradient, surfaces de niveau, extremums. Intégrales multiples, changement de variables, jacobien.", "prereqs": 0}, "MAT1410": {"name": "MAT 1410 - Calcul 2", "description": "Calcul vectoriel : divergence, rotationnel, laplacien. Formules de Green-Riemann, de Stokes et théorème de la divergence. Introduction aux équations différentielles. Équations différentielles linéaires d'ordre un et deux.", "prereqs": ["MAT1400"]}, "MAT1460": {"name": "MAT 1460 - Modélisation", "description": "Initiation à la modélisation. Formulation d'un problème bien cerné, identification des quantités-clés, collection de données fiables, formulation en termes de mathématiques et solution, comparaison des résultats aux données, communication des résultats.", "prereqs": []}, "MAT1500": {"name": "MAT 1500 - Mathématiques discrètes", "description": "Ensembles et fonctions. Lois de la logique, quantificateurs, preuves. Induction, pgcd, nombres premiers, algorithme d’Euclide-Bézout, congruence, récursion.  Principes de comptage, structures discrètes, graphes.", "prereqs": 0}, "MAT1600": {"name": "MAT 1600 - Algèbre linéaire", "description": "Systèmes d'équations linéaires, élimination de Gauss, inverse matricielle. Espace vectoriel, indépendance linéaire, transformations linéaires, changement de base. Produit scalaire. Déterminants. Diagonalisation. Exemples d'applications.", "prereqs": 0}, "MAT1681": {"name": "MAT 1681 - Mathématiques assistées par ordinateur", "description": "Travaux pratiques en Mathematica : expressions, listes, fonctions, récursions, itérations, dérivations, intégrations, graphismes en 2 et 3 dimensions.", "prereqs": ["MAT1681", "MAT1400", "MAT1600"]}, "MAT1720": {"name": "MAT 1720 - Probabilités", "description": "Espace de probabilité. Analyse combinatoire. Probabilité conditionnelle. Indépendance. Variable aléatoire. Fonction de répartition et fonction génératrice. Espérance mathématique. Loi faible des grands nombres. Théorème limite central.", "prereqs": 0}, "MAT2000": {"name": "MAT 2000 - Stage 1", "description": "Stage supervisé faisant appel à des compétences actuarielles, mathématiques ou statistiques.", "prereqs": []}, "MAT2050": {"name": "MAT 2050 - Analyse 2", "description": "L'intégrale de Riemann, le théorème fondamental du calcul. Fonctions trigonométriques, exponentielles et leurs inverses. Suites et séries de fonctions, séries de Taylor, séries de Fourier.", "prereqs": ["MAT1000"]}, "MAT2100": {"name": "MAT 2100 - Analyse 3", "description": "Topologie de Rn. Ensembles ouverts, compacts. Applications continues, différentiables. Jacobien. Théorème de Taylor. Extrema. Théorème des fonctions inverses et implicites.", "prereqs": ["MAT1000"]}, "MAT2115": {"name": "MAT 2115 - Équations différentielles", "description": "Équations du premier et du second ordre. Existence et unicité. Dépendance continue par rapport à la condition initiale. Méthodes analytiques, qualitatives. Systèmes linéaires et non linéaires. Dynamique discrète.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT2130": {"name": "MAT 2130 - Variable complexe", "description": "Fonctions holomorphes d'une variable complexe. Représentation conforme. Équations de Cauchy-Riemann. Théorème de Cauchy. Séries de Laurent. Théorème fondamental des résidus.", "prereqs": ["MAT1000"]}, "MAT2300": {"name": "MAT 2300 - Géométrie différentielle", "description": "Courbes dans R3 : courbure, torsion, équations de Frenet. Surfaces dans R3 : première et seconde formes fondamentales, courbures de Gauss et moyenne. Isométries et theorema egregium.", "prereqs": ["MAT1000", "MAT1400", "MAT1600"]}, "MAT2412": {"name": "MAT 2412 - Analyse numérique", "description": "Propagation d'erreurs. Solution numérique d'équations non linéaires. Interpolation et approximation polynomiale. Dérivation et intégration numériques. Algèbre linéaire : méthodes directes et itératives. Approximation discrète par moindres carrés.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT2450": {"name": "MAT 2450 - Mathématiques et technologie", "description": "Étude de plusieurs sujets dans des domaines où les mathématiques jouent un rôle essentiel pour la technologie : informatique, cryptographie, transports, biotechnologie, pharmacie, traitement d'images, reconnaissances de formes, etc.", "prereqs": ["MAT1400", "MAT1600", "MAT2450", "MAT1720", "MAT1978"]}, "MAT2460": {"name": "MAT 2460 - Dynamiques adaptatives", "description": "Introduction aux dynamiques adaptatives: évolution des génomes, quasi-espèces, dynamiques des jeux, dynamiques de population (finies et infinies), théorie adaptative sur graphes, automates. Applications : biologie, écologie, finance, médecine, etc.", "prereqs": []}, "MAT2466": {"name": "MAT 2466 - Analyse appliquée", "description": "Fonctions Gamma et Bêta, séries de Fourier et d'autres fonctions orthogonales. Problème de Sturm-Liouville, approximation en moyenne quadratique, séparation de variables pour les équations aux dérivées partielles, transformées de Fourier et Laplace.", "prereqs": ["MAT1000", "MAT1400", "MAT1600"]}, "MAT2531": {"name": "MAT 2531 - Histoire des mathématiques", "description": "Les mathématiques dans l'Antiquité. Les mathématiques en Chine, en Inde et chez les Arabes. Les mathématiques en Europe de 500 à 1600. La géométrie analytique. Le calcul infinitésimal. Le développement de l'analyse. Les mathématiques du XXe siècle.", "prereqs": ["MAT2531", "MAT1400", "MAT1600"]}, "MAT2600": {"name": "MAT 2600 - Algèbre 1", "description": "Exemples de groupes : groupe symétrique, groupes linéaires. Sous-groupes et théorème de Lagrange. Groupe quotient et théorèmes d'isomorphisme. Actions et actions linéaires. Théorème de Sylow.", "prereqs": ["MAT1600"]}, "MAT2611": {"name": "MAT 2611 - Algèbre 2", "description": "Anneaux, idéaux et modules, théorèmes d’isomorphisme, factorisation unique dans un domaine principal, forme normale d’un module noetherien sur un domaine principal, forme canonique et forme normale de Jordan d’une matrice.", "prereqs": ["MAT2600"]}, "MAT2717": {"name": "MAT 2717 - Processus stochastiques", "description": "Chaînes de Markov. Processus de Galton-Watson. Processus de Poisson. Processus de mort et de naissance. Étude naïve du mouvement brownien. Applications diverses.", "prereqs": ["MAT1600", "MAT1720", "MAT1978"]}, "MAT2719": {"name": "MAT 2719 - Marches et graphes aléatoires", "description": "Lien entre les marches aléatoires réversibles et les réseaux électriques.  Exemples de graphes aléatoires, dont la percolation et les arbres couvrants. Marches aléatoires sur graphes aléatoires. Méthodes du premier et second moment.", "prereqs": ["MAT1000", "MAT1720", "MAT1978"]}, "MAT2795": {"name": "MAT 2795 - Introduction aux structures intrinsèques des données", "description": "Outils mathématiques utilisés pour comprendre des structures intrinsèques de données empiriques. Localité et régularité dans la construction de géométries globales de données. Représentation, exploration et analyse de géométries globales de données.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT3000": {"name": "MAT 3000 - Stage 2", "description": "Stage supervisé faisant appel à des compétences actuarielles, mathématiques ou statistiques.", "prereqs": []}, "MAT3162": {"name": "MAT 3162 - Équations aux dérivées partielles", "description": "Équations du premier ordre et du second ordre. Caractéristiques et classification. Équations elliptiques : de Laplace, de Poisson. Équation des ondes. Équation de la chaleur. Introduction aux fonctions de Green.", "prereqs": ["MAT1000", "MAT2115"]}, "MAT3300": {"name": "MAT 3300 - Introduction aux variétés différentiables", "description": "Variétés différentiables dans R^n. Espaces tangent et cotangent. Champs de vecteurs.  Degré des applications, indices des zéros des champs des vecteurs. Théorème de point fixe de Brouwer. Théorème fondamental de l’algèbre. Théorème de Poincaré-Hopf.", "prereqs": ["MAT2100"]}, "MAT3363": {"name": "MAT 3363 - Topologie", "description": "Espaces topologiques. Variétés topologiques, définitions et exemples. Théorème de classification des surfaces. Groupe fondamental. Théorème de Van Kampen. Revêtements.", "prereqs": ["MAT1000"]}, "MAT3450": {"name": "MAT 3450 - Introduction à la modélisation mathématique", "description": "Processus de modélisation mathématique: simplification du problème sous étude, formulation mathématique, analyse et interprétation dans la discipline d'origine. Étude de problèmes issus de la biologie contemporaine.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT3460": {"name": "MAT 3460 - Modélisation mathématique spécialisée et appli.", "description": "Processus de modélisation mathématiques avancés: simulations, estimation de paramètres, interprétation. Introduction à l’utilisation des mathématiques dans un milieu multidisciplinaire (médecine, neurosciences, etc.). Étude de cas et projet appliqué.", "prereqs": []}, "MAT3632": {"name": "MAT 3632 - Théorie des nombres", "description": "Théorème fondamental de l'arithmétique. Équations diophantiennes. Congruences linéaires. Théorèmes d'Euler et de Fermat. Théorie des indices. Racines primitives. Résidus quadratiques. Congruences générales. Nombres premiers.", "prereqs": ["MAT1500", "MAT2600"]}, "MAT3634": {"name": "MAT 3634 - Théorie analytique des nombres", "description": "Arguments de comptage, estimations asymptotiques, fonctions arithmétiques et séries de Dirichlet, théorème des nombres premiers. Anatomie des entiers, arguments probabilistes, théorème d’Erdos-Kac.", "prereqs": ["MAT3632"]}, "MAT3661": {"name": "MAT 3661 - Théorie de Galois", "description": "Compléments de théorie des groupes. Théorie des corps, groupe de Galois, corps de Galois, résolubilité d'équation par radicaux. Résolution de problèmes classiques.", "prereqs": ["MAT2600"]}, "MAT4000": {"name": "MAT 4000 - Mémoire de fin d'études", "description": "Un projet est suggéré à chaque étudiant lui permettant de faire une synthèse de ses connaissances mathématiques.  Remarques: L'étudiant soumet un rapport et fait un exposé oral à la fin du trimestre.", "prereqs": []}, "MAT6117": {"name": "MAT 6117 - Mesure et intégration", "description": "Ensembles mesurables, mesure de Lebesgue, théorèmes de Lusin et de Egorov, intégrale de Lebesgue, théorème de Fubini, espaces Lp, éléments de la théorie ergodique, mesure et dimension de Hausdorff, ensembles fractals.", "prereqs": 0}, "MAT6124": {"name": "MAT 6124 - Analyse fonctionnelle", "description": "Espaces d’Hilbert, de Banach, théorèmes de Hahn-Banach, de Banach-Steinhaus et du graphe fermé, topologies faibles, espaces réflexifs, décomposition spectrale des opérateurs auto-adjoints compacts.", "prereqs": 0}, "MAT6701": {"name": "MAT 6701 - Probabilités", "description": "Espace de probabilité, variables aléatoires, indépendance, espérance mathématique, modes de convergence, lois des grands nombres, théorème central limite, espérance conditionnelle et martingales. Introduction au mouvement brownien.", "prereqs": 0}, "PHI1005": {"name": "PHI 1005 - Logique 1", "description": "Logique des connecteurs et logique des quantificateurs.", "prereqs": 0}, "PHI1130": {"name": "PHI 1130 - Philosophie des sciences", "description": "La science comme entreprise rationnelle : spécificité de l'explication scientifique. Notions d'hypothèse, de loi, de théorie. Le développement de la science : modèles continuistes et discontinuistes.", "prereqs": 0}, "PHI1300": {"name": "PHI 1300 - Philosophie de la connaissance", "description": "Introduction à des problématiques fondamentales de la philosophie de la connaissance: la nature de la connaissance, les sources de la connaissance, les types de connaissance, les limites de la connaissance, etc.", "prereqs": 0}, "PHI2005": {"name": "PHI 2005 - Logique 2", "description": "Introduction à la métalogique propositionnelle : complétude et décidabilité de la logique propositionnelle classique. Introduction à des variantes et alternatives logiques intuitionniste, multivalente, modale, floue, etc.", "prereqs": 0}, "PHY1441": {"name": "PHY 1441 - Électromagnétisme", "description": "Lois de Coulomb et de Gauss. Potentiel scalaire. Conducteurs. Énergie électrique et magnétique. Dipôle. Courants et densité de courant électrique. Lois d'Ampère et de Biot et Savart. Potentiel vecteur. Loi de Faraday.", "prereqs": ["PHY1441", "MAT1410"]}, "PHY1620": {"name": "PHY 1620 - Ondes et vibrations", "description": "Oscillations libres, amorties et entretenues. Oscillateurs couplés et modes normaux. Ondes stationnaires. Superposition de modes et analyse de Fourier. Ondes progressives. Réflexion et transmission. Interférence.", "prereqs": ["PHY1651", "MAT1600"]}, "PHY1651": {"name": "PHY 1651 - Mécanique classique 1", "description": "Concepts fondamentaux de la mécanique. Lois de conservation. Rotation autour d'un axe. Forces centrales. Problème de Kepler. Diffusion et section efficace. Gravitation.", "prereqs": 0}, "PHY1652": {"name": "PHY 1652 - Relativité 1", "description": "Référentiels non inertiels. Postulats de relativité. Dilatation du temps. Contractions des longueurs. Transformations de Lorentz. Effet Doppler. Cinématique relativiste. Quadrivecteurs.", "prereqs": ["PHY1651"]}, "PHY1972": {"name": "PHY 1972 - Comprendre l'Univers", "description": "Notions de base en astrophysique. Se repérer dans l'espace et le temps. Visite de l'Univers à petite et grande échelle. Description de l'évolution de l'Univers. Origine et évolution de la vie dans l'Univers.    Remarque: Cours en ligne.", "prereqs": ["PHY1971", "PHY1972", "PHY1972"]}, "PHY2215": {"name": "PHY 2215 - Physique thermique et statistique", "description": "Thermodynamique statistique. Fonctions thermodynamiques. Transformations de phases. Distribution canonique. Méc. stat. Statistiques quantiques. Applications de Gaz de bosons et de fermions.", "prereqs": ["MAT1400"]}, "PHY3131": {"name": "PHY 3131 - Mécanique classique 2", "description": "Formalismes de Lagrange et Hamilton. Transformations canoniques et crochets de Poisson. Formalisme de Hamilton-Jacobi. Mouvements des corps rigides et équations d'Euler.", "prereqs": ["PHY1651"]}, "PHY3140": {"name": "PHY 3140 - Hydrodynamique", "description": "Cinématique et dynamique d'un fluide. Paramètres non dimensionnels. Fluide parfait. Compressibilité. Viscosité, couche limite. Turbulence.", "prereqs": ["MAT2466", "PHY2345"]}, "STT1682": {"name": "STT 1682 - Progiciels statistiques en actuariat", "description": "Présentation de SAS et R; lecture des données; organisation, gestion et manipulation des données; transformation de variables; chaînes de caractères, dates; instructions de condition et de boucle; procédures graphiques; statistiques descriptives.", "prereqs": 0}, "STT1700": {"name": "STT 1700 - Introduction à la statistique", "description": "Description des données. Production de données. Probabilités. Inférence. Intervalles de confiance et tests d'hypothèses. Données de dénombrement. Tableaux de contingence. Régression linéaire simple.  Remarques: Utilisation d'un progiciel.", "prereqs": 0}, "STT2000": {"name": "STT 2000 - Échantillonnage", "description": "Sondages élémentaires, empiriques, stratifiés, systématiques, avec probabilités inégales, à deux degrés. Méthodes de Monte-Carlo : création d'échantillons artificiels, simulation et analyse d'exemples.", "prereqs": ["STT2000", "STT2700"]}, "STT2105": {"name": "STT 2105 - Statistique bayésienne", "description": "Théorie de la décision, lois a priori et a posteriori, règle de Bayes, rapport de Bayes, loi prédictive, région de prévision, modèle hiérarchique, simulations par chaînes de Markov, échantillonneurs de Gibbs et de Metropolis-Hastings.", "prereqs": ["STT2700", "MAT2717"]}, "STT2305": {"name": "STT 2305 - Analyse multivariée appliquée", "description": "Vecteur aléatoire. Matrice des covariances. Loi multinormale. Région de confiance et tests pour le vecteur moyen. Analyses en composantes principales, canonique, discriminante et classification. Lois décentrées.", "prereqs": ["STT2400", "STT2700"]}, "STT2400": {"name": "STT 2400 - Régression linéaire", "description": "Méthode des moindres carrés. Théorèmes de Gauss-Markov et de Cochran. Estimation et tests d'hypothèses. Résidus et diagnostics. Construction de modèles. Exemples.  Remarques: Utilisation du progiciel SAS.", "prereqs": ["MAT1600", "STT2700"]}, "STT2700": {"name": "STT 2700 - Concepts et méthodes en statistique", "description": "Estimation ponctuelle et par intervalle. Tests d'hypothèses. Méthodes graphiques. Test du khi-deux. Théorie de la décision et inférence bayésienne. Comparaisons de deux échantillons. Lié aux examens CAS et agrément ICA.", "prereqs": ["MAT1720", "MAT1978", "STT1700"]}, "STT3220": {"name": "STT 3220 - Méthodes de prévision", "description": "Estimation ponctuelle et par intervalle. Tests d'hypothèses. Méthodes graphiques. Test du khi-deux. Théorie de la décision et inférence bayésienne. Comparaisons de deux échantillons.", "prereqs": ["STT2400", "STT2700"]}, "STT3260": {"name": "STT 3260 - Modèles de survie", "description": "Fonction de survie. Taux de panne. Modèles paramétriques et non paramétriques pour des données complètes. Estimation. Différents types de censure. Modèle de régression. Applications.", "prereqs": ["STT2400", "STT2700"]}, "STT3410": {"name": "STT 3410 - Plans et analyses d'expériences", "description": "Principes. Assignation au hasard. Répliques. Blocs. Effets fixes et aléatoires. Classification simple. Plans factoriels, à mesures répétées, incomplets. Résidus et diagnostics. Applications.    Remarques: Utilisation du progiciel SPSS.", "prereqs": ["STT2400", "STT2700"]}, "STT3510": {"name": "STT 3510 - Biostatistique", "description": "Études de cohortes, études transversales, longitudinales, prospectives. Détermination des tailles d'échantillon dans les devis. Fiabilité des mesures.", "prereqs": ["STT2700"]}, "STT3781": {"name": "STT 3781 - Laboratoire de statistique", "description": "Planification d'expériences et de sondages. Exploration et analyse de données à l'aide de progiciels. Interprétation et communication de résultats.", "prereqs": ["STT3410"]}, "STT3790": {"name": "STT 3790 - Apprentissage statistique", "description": "Évaluation d'un modèle de régression et sélection de variables. Méthodes de rétrécissement. Modèles linéaires généralisés. Méthode des k plus proches voisins. Arbres de décision. Régression non paramétrique.", "prereqs": ["STT2400", "STT2700"]}, "STT3795": {"name": "STT 3795 - Fondements théoriques en science des données", "description": "Classification. Réduction de la dimension. Modélisation de relations avec noyaux de similarité. Regroupements. Apprentissage de variétés. Fondements mathématiques et applications d'algorithmes d'apprentissage.", "prereqs": ["MAT1400", "MAT1600", "MAT1720", "MAT1978"]}, "STT4000": {"name": "STT 4000 - Mémoire de fin d'études", "description": "Un projet est suggéré à chaque étudiant lui permettant de faire une synthèse de ses connaissances en statistique. L'étudiant soumet un rapport et fait un exposé oral à la fin du trimestre.", "prereqs": []}, "STT6230": {"name": "STT 6230 - Méthodes non paramétriques avancées", "description": "Statistiques linéaires de rang. Problèmes de position et de dispersion. Cas d'un ou deux échantillons. Efficacité relative des tests.  Régression non paramétrique : méthodes du noyau et splines de lissage. Tests de permutation et méthode bootstrap.", "prereqs": []}, "STT6516": {"name": "STT 6516 - Données catégorielles", "description": "Tableaux de contingence à plusieurs dimensions. Mesures d'association. Risque relatif, rapport de cote. Tests exacts et asymptotiques. Régression logistique, de Poisson, multinomiale, logistique cumulative. Modèles log-linéaires. Modèles graphiques.", "prereqs": 0}}