{"ACT1240": {"name": "ACT 1240 - Mathématiques financières", "description": "Mesures d'intérêt, valeurs présentes, accumulées, annuités certaines à paiements égaux et non-égaux, remboursement des prêts, obligations, flux monétaires généraux et portefeuilles, duration, immunisation, déterminants des taux d’intérêt.", "prereqs": ["ACT1240", "MAT1240"]}, "ACT2241": {"name": "ACT 2241 - Produits dérivés et gestion de risque", "description": "Options d'achat/vente, contrats à terme/à livrer, stratégies de gestion des risques, évaluation d'options, parité, arbitrage, modèle binomial, modèle de Black-Scholes, couverture dynamique.", "prereqs": ["ACT1240"]}, "ACT2243": {"name": "ACT 2243 - Investissements", "description": "Marchés financiers et actifs financiers qui s'y transigent (actions, titres à revenu fixe). Construction de portefeuilles, frontière efficace. Modèle CAPM. Efficience des marchés et finance comportementale. Mesures de risque.", "prereqs": ["ACT1240"]}, "ACT2284": {"name": "ACT 2284 - Mathématiques de l'assurance IARD", "description": "Théorie de l’estimation et de la sélection de modèles paramétriques. Théorie de la crédibilité. Tarification et réserves.", "prereqs": ["ACT3251", "STT2700"]}, "ACT3230": {"name": "ACT 3230 - Finance mathématique", "description": "Notions de probabilités et calcul stochastique, théorie de l’arbitrage, théorèmes fondamentaux, modèles binomiaux, modèle de Black-Scholes, modèles pour taux d’intérêt, calibration de modèles aux données de marché.", "prereqs": ["ACT2241", "MAT2717"]}, "ACT3251": {"name": "ACT 3251 - Théorie du risque", "description": "Modèles de fréquence et de sévérité des sinistres, modèles collectifs, distribution des pertes totales. Types de contrat d’assurance et de réassurance IARD. Effet de modifications de couverture.", "prereqs": ["MAT1720"]}, "ACT3253": {"name": "ACT 3253 - Gestion des risques", "description": "Types de risques traditionnels et non traditionnels (ex. risque d’entreprise, risques environnementaux). Méthodes qualitatives et quantitatives d’évaluation et de gestion des risques.", "prereqs": ["ACT2250", "ACT3251"]}, "ACT3261": {"name": "ACT 3261 - Modélisation prédictive", "description": "Techniques de description et de visualisation de données. Applications de modèles linéaires généralisés et d’arbres de décision. Techniques de regroupement de données. Communication et vulgarisation des résultats.", "prereqs": ["ACT3251", "STT3790"]}, "ACT3282": {"name": "ACT 3282 - Laboratoire de mathématiques financières", "description": "Étude de problèmes complexes en mathématiques financières. Communication des résultats", "prereqs": ["ACT3230"]}, "IFT1005": {"name": "IFT 1005 - Design et développement Web", "description": "Introduction à l'internet et au Web. Langage de balisage et validation. Standards, accessibilité. Feuilles de styles pour texte et graphique. Design web. Optimisation des sites. Formulaires et interactivité. Introduction aux gestionnaires de contenu.", "prereqs": 0}, "IFT1015": {"name": "IFT 1015 - Programmation 1", "description": "Éléments de base d'un langage de programmation : types, expressions, énoncés conditionnels et itératifs, procédures, fonctions, paramètres, récursivité, tableaux, enregistrements, pointeurs et fichiers.", "prereqs": 0}, "IFT1025": {"name": "IFT 1025 - Programmation 2", "description": "Concepts avancés : classes, objets, héritage, interfaces, réutilisation, événements. Introduction aux structures de données et algorithmes : listes, arbres binaires, fichiers, recherche et tri. Notions d'analyse numérique : précision.", "prereqs": ["IFT1015", "IFT1016"]}, "IFT1065": {"name": "IFT 1065 - Structures discrètes en informatique", "description": "Éléments de logique propositionnelle. Ensembles. Suites et fonctions. Algorithmes. Matrices booléennes. Raisonnement mathématique. Induction. Combinatoire. Relations de récurrence. Graphes, Arbres.", "prereqs": []}, "IFT1215": {"name": "IFT 1215 - Introduction aux systèmes informatiques", "description": "Historique. Composantes d'un ordinateur. Codage des données et des instructions. Langages machine et de haut niveau. Concepts et utilisation d'un système d'exploitation. Introduction à l'Internet. Conséquences sociales de l'informatique.", "prereqs": 0}, "IFT1227": {"name": "IFT 1227 - Architecture des ordinateurs 1", "description": "Jeu d'instructions : RISC vs CISC. Modes d'adressage. Exceptions. Dispositifs d'entrée/sortie, bus, interruptions. Contrôle câblé et microprogrammé. Accélération du traitement : pipelines et parallélisme. Évolution des technologies.", "prereqs": ["IFT1065", "IFT1215"]}, "IFT1575": {"name": "IFT 1575 - Modèles de recherche opérationnelle", "description": "Programmation linéaire. Simplexe. Dualité. Programmation en nombres entiers. Problèmes de réseaux. Méthodes PERT/CPM. Plus court chemin. Programmation dynamique déterministe et probabiliste. Modèles stochastiques.", "prereqs": 0}, "IFT2015": {"name": "IFT 2015 - Structures de données", "description": "Types abstraits pour les structures de données, arbres, dictionnaires, files avec priorités, graphes, méthodes externes.", "prereqs": ["IFT1025", "IFT1065"]}, "IFT2035": {"name": "IFT 2035 - Concepts des langages de programmation", "description": "Historique. Concepts et implantation des entités de base. Mécanismes d'exécution : pile, tas, passage de paramètres. Langage de bas niveau (C). Programmation structurée, fonctionnelle et logique. Langages spécialisés.", "prereqs": ["IFT1025"]}, "IFT2105": {"name": "IFT 2105 - Introduction à l'informatique théorique", "description": "Automates finis et expressions régulières. Grammaires hors-contexte et automates à piles. Calculabilité et décidabilité. Classes de complexité.", "prereqs": ["IFT1015", "IFT1065"]}, "IFT2125": {"name": "IFT 2125 - Introduction à l'algorithmique", "description": "Conception et analyse d'algorithmes. Notation asymptotique, résolution de récurrences. Algorithmes voraces, diviser-pour-régner, programmation dynamique, parcours de graphes, retour-arrière, algorithmes probabilistes.", "prereqs": ["IFT2125", "IFT2015", "MAT1978", "MAT1720"]}, "IFT2245": {"name": "IFT 2245 - Systèmes d'exploitation", "description": "Fonctions principales. Gestion du parallélisme. Synchronisation. Interblocage. Ordonnancement. Gestion de la mémoire et des entrées/sorties. Fichiers. Protection et systèmes distribués.", "prereqs": ["IFT1227", "IFT2035"]}, "IFT2255": {"name": "IFT 2255 - Génie logiciel", "description": "Introduction au génie logiciel. Cycles de développement. Analyse, modélisation et spécification. Conception. Développement orienté objet. Mise au point. Outils et environnements de développement.", "prereqs": ["IFT1025"]}, "IFT2425": {"name": "IFT 2425 - Introduction aux algorithmes numériques", "description": "Arithmétique en point flottant, analyse d'erreurs. Équations linéaires et non linéaires. Interpolation, moindres carrés. Différenciation et intégration numérique. Équations différentielles ordinaires.", "prereqs": ["IFT1015", "MAT1400", "MAT1600"]}, "IFT2455": {"name": "IFT 2455 - Analyse numérique matricielle", "description": "Solution numérique des systèmes d'équations linéaires; inversion; triangularisation. Méthodes directes, méthodes d'itération, etc. Approximation des valeurs propres. Applications diverses.", "prereqs": ["IFT1015", "MAT1600"]}, "IFT2505": {"name": "IFT 2505 - Optimisation linéaire", "description": "Modèles linéaires. Méthode du simplexe. Dualité. Postoptimisation. Analyse de sensibilité. Problèmes à structures particulières. Modèles en nombres entiers. Méthodes de coupes. Séparation et évaluation progressive.", "prereqs": ["MAT1600"]}, "IFT2905": {"name": "IFT 2905 - Interfaces personne-machine", "description": "Concept et langages des interfaces. Programmation par événements. Modèle de l'usager. Design et programmation d'interfaces graphiques. Impact sur les multimédia, la collaboration et la communication.", "prereqs": ["IFT1025", "IFT2905", "IFT3904"]}, "IFT2935": {"name": "IFT 2935 - Bases de données", "description": "Architecture. Modèles d'organisation. Définition, création, mise à jour et consultation. Exploitation.", "prereqs": ["IFT2015", "IFT2935", "IFT3030"]}, "IFT3065": {"name": "IFT 3065 - Langages de programmation et compilation", "description": "Méthodes de compilation et interprétation des langages de programmation. Génération de code, optimisation, transformations de programme. Gestion de la mémoire. Implantation des langages spécialisés.", "prereqs": ["IFT2035", "IFT3065", "IFT3060"]}, "IFT3150": {"name": "IFT 3150 - Projet d'informatique", "description": "Projet défini et encadré par un professeur associé à un laboratoire de recherche universitaire.  Remarques: Préalables explicites selon la nature du projet.", "prereqs": ["IFT3150", "IFT3051"]}, "IFT3151": {"name": "IFT 3151 - Stage d'informatique", "description": "Stage en milieu de travail, donnant lieu à un rapport, évalué conjointement par l'employeur et un jury du DIRO.", "prereqs": ["IFT3151", "IFT3052"]}, "IFT3155": {"name": "IFT 3155 - Informatique quantique", "description": "Calcul réversible; information quantique; non-localité; cryptographie quantique; circuits, parallélisme et interférence quantiques; algorithmes de Simon, Shor et Grover; téléportation; correction d'erreurs; implantation.", "prereqs": []}, "IFT3205": {"name": "IFT 3205 - Traitement du signal", "description": "Systèmes linéaires. Échantillonnage et reconstruction. Convolution. Notation polaire. Transformées-Z et de Fourier. Analyse spectrale. Filtrage numérique (FIR et IIR). Applications dans les domaines de l'audio, de l'image et de la vidéo.", "prereqs": ["MAT1400", "MAT1600", "IFT3205", "IFT3200"]}, "IFT3225": {"name": "IFT 3225 - Technologie de l'Internet", "description": "Introduction aux applications web et organisation des sites web. XML, schémas XML et transformations XSLT. Programmation client (JavaScript) et serveur (CGI, PHP, Ajax). Moteurs de recherche. Design web. Introduction au web sémantique.", "prereqs": ["IFT1005", "IFT2015", "IFT3225", "IFT3220"]}, "IFT3245": {"name": "IFT 3245 - Simulation et modèles", "description": "Modèles de simulation. Simulations continues et à événements discrets. Modélisation stochastique. Validation et réalisme. Analyse des résultats. Technique de réduction de la variance. Génération de valeurs pseudoaléatoires.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "PHY2215", "IFT3245", "IFT3240"]}, "IFT3275": {"name": "IFT 3275 - Sécurité informatique", "description": "Confidentialité et intégrité des données à clé privée et publique. Protection des couches de protocoles TCP/IP; protection contre les parasites informatiques. Méthodes d'authentification d'usagers. Évaluation et gestion des risques.", "prereqs": 0}, "IFT3295": {"name": "IFT 3295 - Bio-informatique", "description": "Biologie moléculaire pour l'informaticien, biomolécules, transcription, traduction. Algorithmes de programmation dynamique, alignements de séquences, prédiction de structures d'ARN. Réseaux de régulation génétique. Phylogénie, génomique comparative.", "prereqs": ["IFT2015", "IFT3295", "IFT3290"]}, "IFT3325": {"name": "IFT 3325 - Téléinformatique", "description": "Architecture des systèmes répartis. Modèle de référence OSI. Introduction aux moyens physiques de transmission de données. Protocoles de lien, de routage et de contrôle de flux. Introduction aux réseaux d'ordinateurs et à leurs protocoles.", "prereqs": ["IFT2245", "IFT3325", "IFT3320"]}, "IFT3335": {"name": "IFT 3335 - Intelligence artificielle : introduction", "description": "Résolution heuristique de problèmes. Représentation des connaissances. Techniques d'inférence et de planification. Étude d'un langage approprié. Traitement de langue naturelle. Apprentissage. Systèmes experts.", "prereqs": ["IFT3335", "IFT3330"]}, "IFT3355": {"name": "IFT 3355 - Infographie", "description": "2D : tracé, remplissage. 3D : transformations, projections. Surfaces cachées. Illumination : modèles de réflexion. Textures : antialiassage. Modélisation : surfaces paramétriques. Animation : interpolation, cinématique, dynamique.", "prereqs": ["IFT2015", "IFT3355", "IFT3350"]}, "IFT3375": {"name": "IFT 3375 - Informatique théorique", "description": "Modèles du calcul. Calculabilité et décidabilité. Complexité. Hiérarchies. Complétudes. Sujets choisis.", "prereqs": ["IFT2105", "IFT3375", "IFT3370"]}, "IFT3395": {"name": "IFT 3395 - Fondements de l'apprentissage machine", "description": "Éléments de base des algorithmes d'apprentissage statistique et symbolique. Exemples d'applications en forage de données, reconnaissance des formes, régression non linéaire, et données temporelles.  Remarques: Des connaissances d'analyse numérique sont recommandées, par exemple le IFT 2425.", "prereqs": ["MAT1600", "MAT1978", "IFT2125", "IFT3395", "IFT3390"]}, "IFT3515": {"name": "IFT 3515 - Optimisation non linéaire", "description": "Programmation non linéaire. Conditions d'optimalité avec et sans contraintes. Méthodes de directions de descente, de Newton et quasi-Newton. Méthodes de recherche linéaire et de régions de confiance. Méthode de points intérieurs.", "prereqs": ["MAT1600"]}, "IFT3545": {"name": "IFT 3545 - Graphes et réseaux", "description": "Introduction à la théorie des graphes et à ses applications en informatique. Arborescences, connexité, coloriages, stabilité. Algorithmes sur les graphes. Applications.", "prereqs": ["IFT3545", "IFT3540"]}, "IFT3655": {"name": "IFT 3655 - Modèles stochastiques", "description": "Processus stochastiques. Chaînes de Markov. Horizons finis et infinis. Actualisation. Files d'attente. Processus de décision markoviens. Résolution d'équations de récurrence. Modèles d'inventaire. Fiabilité.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "IFT3655", "IFT3651"]}, "IFT3700": {"name": "IFT 3700 - Introduction à la science des données", "description": "Mise en contexte et applications des probabilités, statistiques, optimisation et outils informatiques pour la science des données; nettoyage et visualisation de données; enjeux statistiques de l'apprentissage automatique sur données structurées.", "prereqs": ["IFT2015", "MAT1978", "MAT1720", "STT1700"]}, "IFT3710": {"name": "IFT 3710 - Projets en aprentissage automatique", "description": "Préparation aux applications pratiques de l'apprentissage automatique à travers des projets concrets sur les données réelles. Utilisation de logiciels spécialisés d'apprentissage automatique pour l'intelligence artificielle.", "prereqs": ["IFT3700", "IFT3395"]}, "IFT3911": {"name": "IFT 3911 - Analyse et conception des logiciels", "description": "Ingénierie des besoins. Méthodes de spécification formelle. Principes, méthodes et notations de conception. Description et styles d'architectures logicielles. Composantes logicielles, patrons de conception et cadres d'application.", "prereqs": ["IFT2255", "IFT3911", "IFT3901"]}, "IFT3913": {"name": "IFT 3913 - Qualité du logiciel et métriques", "description": "Définition et promotion de la qualité. Assurance qualité. Plan de qualité. Amélioration et contrôle de qualité (tests, revue, inspections). Normes et cadres de qualité. Théorie de la mesure. Métriques de produit et de processus. Métriques de qualité.", "prereqs": ["IFT2255", "IFT3913", "IFT3903"]}, "MAT1000": {"name": "MAT 1000 - Analyse 1", "description": "Propriétés des nombres réels, concepts topologiques dans R, suites et séries numériques, propriétés des fonctions continues et fonctions dérivables d'une variable réelle à valeurs réelles.", "prereqs": 0}, "MAT1400": {"name": "MAT 1400 - Calcul 1", "description": "Suites, séries. Fonctions de plusieurs variables, continuité, dérivées partielles, différentielles, plan tangent, dérivation en chaîne. Gradient, surfaces de niveau, extremums. Intégrales multiples, changement de variables, jacobien.", "prereqs": 0}, "MAT1410": {"name": "MAT 1410 - Calcul 2", "description": "Calcul vectoriel : divergence, rotationnel, laplacien. Formules de Green-Riemann, de Stokes et théorème de la divergence. Introduction aux équations différentielles. Équations différentielles linéaires d'ordre un et deux.", "prereqs": ["MAT1400"]}, "MAT1600": {"name": "MAT 1600 - Algèbre linéaire", "description": "Systèmes d'équations linéaires, élimination de Gauss, inverse matricielle. Espace vectoriel, indépendance linéaire, transformations linéaires, changement de base. Produit scalaire. Déterminants. Diagonalisation. Exemples d'applications.", "prereqs": 0}, "MAT1720": {"name": "MAT 1720 - Probabilités", "description": "Espace de probabilité. Analyse combinatoire. Probabilité conditionnelle. Indépendance. Variable aléatoire. Fonction de répartition et fonction génératrice. Espérance mathématique. Loi faible des grands nombres. Théorème limite central.", "prereqs": 0}, "MAT2050": {"name": "MAT 2050 - Analyse 2", "description": "L'intégrale de Riemann, le théorème fondamental du calcul. Fonctions trigonométriques, exponentielles et leurs inverses. Suites et séries de fonctions, séries de Taylor, séries de Fourier.", "prereqs": ["MAT1000"]}, "MAT2100": {"name": "MAT 2100 - Analyse 3", "description": "Topologie de Rn. Ensembles ouverts, compacts. Applications continues, différentiables. Jacobien. Théorème de Taylor. Extrema. Théorème des fonctions inverses et implicites.", "prereqs": ["MAT1000"]}, "MAT2115": {"name": "MAT 2115 - Équations différentielles", "description": "Équations du premier et du second ordre. Existence et unicité. Dépendance continue par rapport à la condition initiale. Méthodes analytiques, qualitatives. Systèmes linéaires et non linéaires. Dynamique discrète.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT2130": {"name": "MAT 2130 - Variable complexe", "description": "Fonctions holomorphes d'une variable complexe. Représentation conforme. Équations de Cauchy-Riemann. Théorème de Cauchy. Séries de Laurent. Théorème fondamental des résidus.", "prereqs": ["MAT1000"]}, "MAT2300": {"name": "MAT 2300 - Géométrie différentielle", "description": "Courbes dans R3 : courbure, torsion, équations de Frenet. Surfaces dans R3 : première et seconde formes fondamentales, courbures de Gauss et moyenne. Isométries et theorema egregium.", "prereqs": ["MAT1000", "MAT1400", "MAT1600"]}, "MAT2412": {"name": "MAT 2412 - Analyse numérique", "description": "Propagation d'erreurs. Solution numérique d'équations non linéaires. Interpolation et approximation polynomiale. Dérivation et intégration numériques. Algèbre linéaire : méthodes directes et itératives. Approximation discrète par moindres carrés.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT2460": {"name": "MAT 2460 - Dynamiques adaptatives", "description": "Introduction aux dynamiques adaptatives: évolution des génomes, quasi-espèces, dynamiques des jeux, dynamiques de population (finies et infinies), théorie adaptative sur graphes, automates. Applications : biologie, écologie, finance, médecine, etc.", "prereqs": []}, "MAT2466": {"name": "MAT 2466 - Analyse appliquée", "description": "Fonctions Gamma et Bêta, séries de Fourier et d'autres fonctions orthogonales. Problème de Sturm-Liouville, approximation en moyenne quadratique, séparation de variables pour les équations aux dérivées partielles, transformées de Fourier et Laplace.", "prereqs": ["MAT1000", "MAT1400", "MAT1600"]}, "MAT2600": {"name": "MAT 2600 - Algèbre 1", "description": "Exemples de groupes : groupe symétrique, groupes linéaires. Sous-groupes et théorème de Lagrange. Groupe quotient et théorèmes d'isomorphisme. Actions et actions linéaires. Théorème de Sylow.", "prereqs": ["MAT1600"]}, "MAT2611": {"name": "MAT 2611 - Algèbre 2", "description": "Anneaux, idéaux et modules, théorèmes d’isomorphisme, factorisation unique dans un domaine principal, forme normale d’un module noetherien sur un domaine principal, forme canonique et forme normale de Jordan d’une matrice.", "prereqs": ["MAT2600"]}, "MAT2717": {"name": "MAT 2717 - Processus stochastiques", "description": "Chaînes de Markov. Processus de Galton-Watson. Processus de Poisson. Processus de mort et de naissance. Étude naïve du mouvement brownien. Applications diverses.", "prereqs": ["MAT1600", "MAT1720", "MAT1978"]}, "MAT2719": {"name": "MAT 2719 - Marches et graphes aléatoires", "description": "Lien entre les marches aléatoires réversibles et les réseaux électriques.  Exemples de graphes aléatoires, dont la percolation et les arbres couvrants. Marches aléatoires sur graphes aléatoires. Méthodes du premier et second moment.", "prereqs": ["MAT1000", "MAT1720", "MAT1978"]}, "MAT2795": {"name": "MAT 2795 - Introduction aux structures intrinsèques des données", "description": "Outils mathématiques utilisés pour comprendre des structures intrinsèques de données empiriques. Localité et régularité dans la construction de géométries globales de données. Représentation, exploration et analyse de géométries globales de données.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT3162": {"name": "MAT 3162 - Équations aux dérivées partielles", "description": "Équations du premier ordre et du second ordre. Caractéristiques et classification. Équations elliptiques : de Laplace, de Poisson. Équation des ondes. Équation de la chaleur. Introduction aux fonctions de Green.", "prereqs": ["MAT1000", "MAT2115"]}, "MAT3300": {"name": "MAT 3300 - Introduction aux variétés différentiables", "description": "Variétés différentiables dans R^n. Espaces tangent et cotangent. Champs de vecteurs.  Degré des applications, indices des zéros des champs des vecteurs. Théorème de point fixe de Brouwer. Théorème fondamental de l’algèbre. Théorème de Poincaré-Hopf.", "prereqs": ["MAT2100"]}, "MAT3363": {"name": "MAT 3363 - Topologie", "description": "Espaces topologiques. Variétés topologiques, définitions et exemples. Théorème de classification des surfaces. Groupe fondamental. Théorème de Van Kampen. Revêtements.", "prereqs": ["MAT1000"]}, "MAT3450": {"name": "MAT 3450 - Introduction à la modélisation mathématique", "description": "Processus de modélisation mathématique: simplification du problème sous étude, formulation mathématique, analyse et interprétation dans la discipline d'origine. Étude de problèmes issus de la biologie contemporaine.", "prereqs": ["MAT1400", "MAT1600"]}, "MAT3460": {"name": "MAT 3460 - Modélisation mathématique spécialisée et appli.", "description": "Processus de modélisation mathématiques avancés: simulations, estimation de paramètres, interprétation. Introduction à l’utilisation des mathématiques dans un milieu multidisciplinaire (médecine, neurosciences, etc.). Étude de cas et projet appliqué.", "prereqs": []}, "MAT3632": {"name": "MAT 3632 - Théorie des nombres", "description": "Théorème fondamental de l'arithmétique. Équations diophantiennes. Congruences linéaires. Théorèmes d'Euler et de Fermat. Théorie des indices. Racines primitives. Résidus quadratiques. Congruences générales. Nombres premiers.", "prereqs": ["MAT1500", "MAT2600"]}, "MAT3634": {"name": "MAT 3634 - Théorie analytique des nombres", "description": "Arguments de comptage, estimations asymptotiques, fonctions arithmétiques et séries de Dirichlet, théorème des nombres premiers. Anatomie des entiers, arguments probabilistes, théorème d’Erdos-Kac.", "prereqs": ["MAT3632"]}, "MAT3661": {"name": "MAT 3661 - Théorie de Galois", "description": "Compléments de théorie des groupes. Théorie des corps, groupe de Galois, corps de Galois, résolubilité d'équation par radicaux. Résolution de problèmes classiques.", "prereqs": ["MAT2600"]}, "MAT4000": {"name": "MAT 4000 - Mémoire de fin d'études", "description": "Un projet est suggéré à chaque étudiant lui permettant de faire une synthèse de ses connaissances mathématiques.  Remarques: L'étudiant soumet un rapport et fait un exposé oral à la fin du trimestre.", "prereqs": []}, "STT1700": {"name": "STT 1700 - Introduction à la statistique", "description": "Description des données. Production de données. Probabilités. Inférence. Intervalles de confiance et tests d'hypothèses. Données de dénombrement. Tableaux de contingence. Régression linéaire simple.  Remarques: Utilisation d'un progiciel.", "prereqs": 0}, "STT2000": {"name": "STT 2000 - Échantillonnage", "description": "Sondages élémentaires, empiriques, stratifiés, systématiques, avec probabilités inégales, à deux degrés. Méthodes de Monte-Carlo : création d'échantillons artificiels, simulation et analyse d'exemples.", "prereqs": ["STT2000", "STT2700"]}, "STT2105": {"name": "STT 2105 - Statistique bayésienne", "description": "Théorie de la décision, lois a priori et a posteriori, règle de Bayes, rapport de Bayes, loi prédictive, région de prévision, modèle hiérarchique, simulations par chaînes de Markov, échantillonneurs de Gibbs et de Metropolis-Hastings.", "prereqs": ["STT2700", "MAT2717"]}, "STT2305": {"name": "STT 2305 - Analyse multivariée appliquée", "description": "Vecteur aléatoire. Matrice des covariances. Loi multinormale. Région de confiance et tests pour le vecteur moyen. Analyses en composantes principales, canonique, discriminante et classification. Lois décentrées.", "prereqs": ["STT2400", "STT2700"]}, "STT2400": {"name": "STT 2400 - Régression linéaire", "description": "Méthode des moindres carrés. Théorèmes de Gauss-Markov et de Cochran. Estimation et tests d'hypothèses. Résidus et diagnostics. Construction de modèles. Exemples.  Remarques: Utilisation du progiciel SAS.", "prereqs": ["MAT1600", "STT2700"]}, "STT2700": {"name": "STT 2700 - Concepts et méthodes en statistique", "description": "Estimation ponctuelle et par intervalle. Tests d'hypothèses. Méthodes graphiques. Test du khi-deux. Théorie de la décision et inférence bayésienne. Comparaisons de deux échantillons. Lié aux examens CAS et agrément ICA.", "prereqs": ["MAT1720", "MAT1978", "STT1700"]}, "STT3220": {"name": "STT 3220 - Méthodes de prévision", "description": "Estimation ponctuelle et par intervalle. Tests d'hypothèses. Méthodes graphiques. Test du khi-deux. Théorie de la décision et inférence bayésienne. Comparaisons de deux échantillons.", "prereqs": ["STT2400", "STT2700"]}, "STT3260": {"name": "STT 3260 - Modèles de survie", "description": "Fonction de survie. Taux de panne. Modèles paramétriques et non paramétriques pour des données complètes. Estimation. Différents types de censure. Modèle de régression. Applications.", "prereqs": ["STT2400", "STT2700"]}, "STT3410": {"name": "STT 3410 - Plans et analyses d'expériences", "description": "Principes. Assignation au hasard. Répliques. Blocs. Effets fixes et aléatoires. Classification simple. Plans factoriels, à mesures répétées, incomplets. Résidus et diagnostics. Applications.    Remarques: Utilisation du progiciel SPSS.", "prereqs": ["STT2400", "STT2700"]}, "STT3510": {"name": "STT 3510 - Biostatistique", "description": "Études de cohortes, études transversales, longitudinales, prospectives. Détermination des tailles d'échantillon dans les devis. Fiabilité des mesures.", "prereqs": ["STT2700"]}, "STT3781": {"name": "STT 3781 - Laboratoire de statistique", "description": "Planification d'expériences et de sondages. Exploration et analyse de données à l'aide de progiciels. Interprétation et communication de résultats.", "prereqs": ["STT3410"]}, "STT3790": {"name": "STT 3790 - Apprentissage statistique", "description": "Évaluation d'un modèle de régression et sélection de variables. Méthodes de rétrécissement. Modèles linéaires généralisés. Méthode des k plus proches voisins. Arbres de décision. Régression non paramétrique.", "prereqs": ["STT2400", "STT2700"]}, "STT3795": {"name": "STT 3795 - Fondements théoriques en science des données", "description": "Classification. Réduction de la dimension. Modélisation de relations avec noyaux de similarité. Regroupements. Apprentissage de variétés. Fondements mathématiques et applications d'algorithmes d'apprentissage.", "prereqs": ["MAT1400", "MAT1600", "MAT1720", "MAT1978"]}, "STT4000": {"name": "STT 4000 - Mémoire de fin d'études", "description": "Un projet est suggéré à chaque étudiant lui permettant de faire une synthèse de ses connaissances en statistique. L'étudiant soumet un rapport et fait un exposé oral à la fin du trimestre.", "prereqs": []}}